Repository: arsijo/ejudge-translation
Catalog: ejudge.po
Languages: uk

source: DB timestamp
uk: Відмітка часу в BD

source: DISQUALIFY users
uk: ДИСКВАЛІФІКУВАТИ користувачів

source: Database error
uk: Помилка бази даних

source: Date penalty formula
uk: Формула штрафу за час

source: Deactivate
uk: Деактивувати

source: Deadline
uk: Час здачі

source: Deadline for this problem is expired
uk: Термін здачі даної задачі сплив

source: Dec
uk: Гру

source: Default
uk: Типове значення

source: Default value
uk: Типове значення

source: Del CHIEF EXAMINER
uk: Видалити роль ГОЛОВНОГО ЕКЗАМЕНАТОРА

source: Del COORDINATOR
uk: Видалити роль КООРДИНАТОРА

source: Del EXAMINER
uk: Видалити роль ЕКЗАМЕНАТОРА

source: Del OBSERVER
uk: Видалити роль СПОСТЕРІГАЧА

source: Delete
uk: Видалити

source: Delete Avatar
uk: Видалити аватар

source: Delete all
uk: Видалити все

source: Delete row
uk: Видалити рядок

source: Delete!
uk: Видалити!

source: Deleting role %d of user %d from contest %d failed
uk: Не вдалося видалити роль %d у користувача %d в турнірі %d

source: Deleting role of user from contest failed
uk: Не вдалося видалити роль у користувача в турнірі

source: Deny
uk: Відмовити

source: Desired EOLN Type
uk: Бажаний тип кінців рядків

source: Detailed information about participant
uk: Детальна інформація про учасника

source: Detailed information for user (team)
uk: Детальна інформація про користувача (команду)

source: Details
uk: Деталі

source: Details for user
uk: Детальна інформація про користувача

source: Directory structure
uk: Структура каталогів

source: Disable &quot;Name&quot; field
uk: Заборонити поле &quot;Ім’я&quot;

source: Disable clarifications
uk: Заборонити надсилання учасниками повідомлень

source: Disable locale change
uk: Заборонити зміну язику інтерфейсу

source: Disable password change
uk: Заборонити зміну пароля

source: Disable separate team password
uk: Заборонити турнирні паролі

source: Disable team member deletion
uk: Заборонити видалення членів команди

source: Disabled
uk: Заборонений

source: Discipline
uk: Навчальна дисципліна

source: Disk read error (nonexistant file?)
uk: Помилка зчитування з диска (файла не існує?)

source: Disk write error (disk full?)
uk: Помилка запису на диск (закінчилося місце?)

source: Disqualification explanation
uk: Пояснення причини дискваліфікації

source: Disqualified
uk: Дискваліфіковано

source: Disqualified runs
uk: Дискваліфіковані відправки

source: Disqualified?
uk: Дискваліфіковано?

source: Disqualify
uk: Дискваліфікувати

source: Disqualify displayed runs
uk: Дискваліфікувати відображувані посилки

source: Disqualify displayed runs!
uk: Дискваліфікувати відображувані посилки!

source: Disqualify runs
uk: Дискваліфікувати посилки

source: Disqualify selected users
uk: Дискваліфікувати відмічених учасників

source: Disqualify user
uk: Дискваліфікувати учасника

source: Do not show before the contest starts?
uk: Не показувати до початку турніру?

source: Down all
uk: Вниз все

source: Download OK and PR runs
uk: Завантажити лише відправки у стані OK та RP

source: Download OK runs
uk: Завантажити лише успішні посилки

source: Download OK, PR, RJ, IG, PD, DQ runs
uk: Завантажити лише відправки у станах OK, PR, RJ, IG, PD, DQ

source: Download all runs
uk: Завантажити всі посилки

source: Download archive of runs
uk: Завантажити архів посилок

source: Download run
uk: Завантажити посилку

source: Download runs
uk: Завантажити посилки

source: Download runs configuration
uk: Конфігурація завантажуваних посилок

source: Download selected runs
uk: Завантажити вибрані посилки

source: Dump data
uk: Вигрузити данні

source: Dump runs in CSV format
uk: Вивести базу посилок у CSV-форматі

source: Dump users in CSV format
uk: Вивести базу користувачів у CSV-форматі

source: Duration
uk: Тривалість

source: E-mail
uk: Ел. адреса

source: E-mail contains invalid characters
uk: Поле "Ел. адреса" містить недопустимі символи

source: E-mail is not specified
uk: Поле "Ел. адреса" не заповнено

source: EMPTY
uk: ПУСТО

source: EOLN Type
uk: Тип кінців рядків

source: EXAM IS RUNNING (frozen)
uk: ЕКЗАМЕН ТРИВАЄ (заморожено)

source: Edit
uk: Редагувати

source: Edit Registration Form
uk: Редагувати Реєстраційну форму

source: Edit comment
uk: Змінити коментар

source: Editing clar
uk: Редагування повідомлення

source: Editing general info
uk: Редагування загальної інформації

source: Editing member info
uk: Редагування учасників

source: Editing run
uk: Редагування повідомлення

source: Elapsed time
uk: Сплило часу

source: Empty
uk: Не заповнено

source: Empty submit
uk: Порожня посилка

source: Empty text of warning
uk: Текст попередження порожній

source: Enable password restoration
uk: Дозволити відновлення паролю

source: Enable simple registration (no email)
uk: Дозволити спрощену реєстрацію (без e-mail)

source: End time
uk: Час завершення

source: Enqueue Time
uk: Час постановки

source: Error
uk: Помилка

source: Error details follow
uk: Деталі помилки наведені нижче

source: Error during run comparison
uk: Помилка під час порівняння програм

source: Exam Id
uk: Id екз.

source: Exam finish time
uk: Час завершення екзамену

source: Exam start time
uk: Час початку екзамену

source: Exam status
uk: Стан екзамену

source: Examination information
uk: Інформація про екзаменованих

source: Examination mode
uk: Режим екзамена

source: Examiner
uk: Екзаменатор

source: Examiners
uk: Екзаменатори

source: Examiners assignments
uk: Розподіл екзаменаторів

source: Examples
uk: Приклади

source: Exit code
uk: Код завершення

source: Export runs in XML external format
uk: Зберегти журнал посилок у зовнішньому XML-форматі

source: External ID
uk: Зовнішній ID

source: Extra info
uk: Дод. інформація

source: Faculty
uk: Факультет

source: Faculty (En)
uk: Факультет (Англ.)

source: Faculty (abbreviated)
uk: Факультет (абревіатура)

source: Faculty (abbreviated) (En)
uk: Факультет (абревіатура) (Англ.)

source: Faculty (short)
uk: Факультет (скор.)

source: Faculty (short) (En)
uk: Факультет (скор.) (Англ.)

source: Failed test
uk: Помилка на тесті

source: Failed to add row %d to runlog
uk: Помилка додавання рядка %d в базу

source: Failed to fetch run log entry
uk: Помилка зчитування запису про посилку з диска

source: Failed to fetch run log entry %d
uk: Помилка зчитування запису про посилку %d з диска

source: Family name
uk: Прізвище

source: Family name (En)
uk: Прізвище (Англ.)

source: Feb
uk: Лют

source: Female
uk: Жін.

source: Field "%s" contains non-printable characters.
uk: Поле "%s" містить невідображувані символи.

source: Field "Name" contains non-printable characters
uk: Поле "Ім’я" містить невідображувані символи

source: Field 0
uk: Поле 0

source: Field 1
uk: Поле 1

source: Field 2
uk: Поле 2

source: Field 3
uk: Поле 3

source: Field 4
uk: Поле 4

source: Field 5
uk: Поле 5

source: Field 6
uk: Поле 6

source: Field 7
uk: Поле 7

source: Field 8
uk: Поле 8

source: Field 9
uk: Поле 9

source: File
uk: Файл

source: File is empty
uk: Файл порожній

source: File is not specified
uk: Файл не задано

source: File name pattern
uk: Шаблон імені файла

source: Filter expression
uk: Умова фільтрування

source: Filter expression errors
uk: Помилки у фільтрі

source: Filtered
uk: Відібрано

source: Final test visibility rules
uk: Фінальні правила видимості тестів

source: Final visibility rules are active
uk: Фінальні правила видимості тестів активні

source: Finish session
uk: Завершити сеанс роботи

source: Finish the exam
uk: Завершити екзамен

source: Finish time
uk: Час завершення

source: First User_Id
uk: Перший User_Id

source: First clar
uk: Перше повідомлення

source: First name
uk: Ім’я

source: First name (En)
uk: Ім’я (Англ.)

source: First run
uk: Перша посилка

source: Flags
uk: Атрибути

source: Force contest registration
uk: Почати реєстрацію на турнір

source: Force start virtual contest
uk: Почати віртуальний турнір

source: Force virtual contest start for the selected users
uk: Почати віртуальний турнір для відмічених користувачів

source: Forget changes
uk: Забути зміни

source: Forget editing
uk: Забути редагування

source: Forget it
uk: Забути це

source: Forgot password?
uk: Забули пароль?

source: Formatting rules violation
uk: Порушення правил оформлення програм

source: Free registration
uk: Вільна реєстрація

source: Freeze contest standings
uk: Не оновлювати таблицю результатів

source: From
uk: Від

source: From scratch
uk: З нуля

source: Full path
uk: Повний шлях

source: Full rejudge displayed runs
uk: Заново перевірити відображувані посилки

source: Full score
uk: Повний бал

source: Fully rejudge displayed runs
uk: Заново перевірити відображувані посилки

source: Fully rejudge displayed runs!
uk: Заново перевірити відображувані посилки!

source: Fully rejudge runs
uk: Заново перевірити посилки

source: Further testing information is not available
uk: Подальша інформація про тестування відсутня

source: Gender
uk: Стать

source: General info
uk: Загальна інформація

source: General information
uk: Загальна інформація

source: General registration form fields
uk: Загальні поля реєстраціонної анкети

source: General settings (contest.xml)
uk: Загальні налаштування (contest.xml)

source: Generate Token for Telegram
uk: Згенерувати Токен для Telegram

source: Generate contest passwords
uk: Перегенерувати турнірні паролі

source: Generate random contest passwords
uk: Згенерувати випадкові турнірні паролі

source: Generate random contest passwords!
uk: Згенерувати випадкові турнірні паролі!

source: Generate random registration passwords
uk: Згенерувати випадкові реєстраційні паролі

source: Generate random registration passwords!
uk: Згенерувати випадкові реєстраційні паролі!

source: Generate registration passwords
uk: Перегенерувати реєстраційні паролі

source: Generate!
uk: Згенерувати!

source: Global settings (serve.cfg)
uk: Глобальні налаштування (serve.cfg)

source: Good!
uk: Відмінно!

source: Grade
uk: Рівень (клас, курс)

source: Group
uk: Група (клас)

source: Group (En)
uk: Група (клас) (Англ.)

source: Guest
uk: Гість

source: Guests
uk: Гості

source: Hash value
uk: Геш-код

source: Header row defines %d columns, but row %d has %zu columns
uk: Заголовок визначає %d стовпців, а рядок %d містить %zu стовпців

source: Hello, New random password was successfully generated!
uk: Добрий день! Новий випадковий пароль успішно згенеровано.

source: Hello, Somebody (probably you) has registered a new account to participate in contest "%Cn"%V1 using this e-mail address (%Ue). Registration has completed successfully. This message contains your login and password for your convenience. login: %Ul password: %Uz URL: %Vu Regards, The ejudge contest administration system (www.ejudge.ru)
uk: Добрий день! Хтось (скоріше за все Ви) указав цю адресу (%Ue) під час реєстрації нового користувача для участі в турнірі "%LCn"%V1. Реєстрацію успішно завершено. Цей лист містить Ваші логін і пароль, його надіслано Вам задля Вашої зручності. логін: %Ul пароль: %Uz URL персональної сторінки: %Vu З повагою Система проведення турнірів ejudge (www.ejudge.ru)

source: Hello, Somebody (probably you) have requested registration password regeneration for login `%s'.
uk: Добрий день! Хтось (скоріше за все Ви) зробив запит на повторну генерацію реєстраційного пароля для логіна `%s'.

source: Hello, Somebody (probably you) have specified this e-mail address (%Ue) when registering an account on the %Vn%V1. To confirm registration, you should enter the provided login and password on the login page of the server at the following url: %Vu. Note, that if you do not do this in 24 hours from the moment of sending this letter, registration will be void. login: %Ul password: %Uz Regards, The ejudge contest administration system (www.ejudge.ru)
uk: Добрий день! Хтось (скоріше за все Ви) вказав цю адресу (%Ue) під час реєстрації на сервері "%LVn"%V1. Щоб підтвердити реєстрацію, Вам потрібно ввести надані в цьому листі логін і пароль при вході в систему за адресою: %Vu. Зверніть увагу, що якщо Ви не зробите цього протягом 24 годин з моменту створення даного листа, реєстрацію буде анульовано. логін: %Ul пароль: %Uz З повагою Система проведення турнірів ejudge (www.ejudge.ru)

source: Hello, Somebody (probably you) have specified this e-mail address (%Ue) when registering an account to participate in "%Cn"%V1. To confirm registration, you should enter the provided login and password on the login page of the server at the following url: %Vu. Note, that if you do not do this in 24 hours from the moment of sending this letter, registration will be void. login: %Ul password: %Uz Regards, The ejudge contest administration system (www.ejudge.ru)
uk: Добрий день! Хтось (скоріше за все Ви) вказав цю адресу (%Ue) під час реєстрації для участі в турнірі "%LCn"%V1. Щоб підтвердити реєстрацію, Вам потрібно ввести надані в цьому листі логін і пароль при вході в систему за адресою: %Vu. Зверніть увагу, що якщо Ви не зробите цього протягом 24 годин з моменту створення даного листа, реєстрацію буде анульовано. логін: %Ul пароль: %Uz З повагою Система проведення турнірів ejudge (www.ejudge.ru)

source: Hello, User `%s' (email %s) completed password regeneration in contest %d from IP %s
uk: Добрий день! Користувач `%s' (ел. адреса %s) завершив процедуру повторної генерації реєстраційного пароля в турнирі %d з IP-адреси %s

source: Hello, User `%s' (email %s) has initiated password regeneration in contest %d from IP %s
uk: Добрий день! Користувач `%s' (ел. адреса %s) почав процедуру повторної генерації реєстраційного пароля в турнірі %d з IP-адреси %s

source: Help
uk: Допомога

source: Hidden?
uk: Приховано?

source: Hide closed contests
uk: Сховати закриті контести

source: Hide compiler options
uk: Сховати опції компіляторів

source: Hide details
uk: Сховати деталі

source: Hide extended info
uk: Сховати розширену інформацію

source: Hide hidden contests
uk: Сховати приховані контести

source: Hide unmanageable contests
uk: Сховати немодеровані контести

source: Homepage
uk: Особиста веб-сторінка

source: IP address
uk: IP-адреса

source: IP addresses
uk: IP-адреси

source: IP addresses for users
uk: IP-адреси користувачів

source: IPC operation failed
uk: Операція IPC завершилася з помилкою

source: If you already have an ejudge account on this server, you may use it. If so, follow the link
uk: Якщо Ви вже маєте обліковий запис у системі ejudge на цьому сервері, Ви можете користуватися ним. Для цього перейдіть за посиланням

source: Ignore displayed runs
uk: Ігнорувати відображувані посилки

source: Ignore displayed runs!
uk: Ігнорувати відображувані посилки!

source: Ignore runs
uk: Ігнорувати посилки

source: Ignored
uk: Проігноровано

source: Ignoring empty column %d
uk: Порожній стовпець %d ігнорується

source: Ignoring unsupported column %d (%s)
uk: Непідтримуваний стовпець %d (%s) ігнорується

source: Import
uk: Імпорт

source: Imported?
uk: Імпортовано?

source: In order to complete the registration procedure, hit the "Confirm registration" link.
uk: Для завершення процедури реєстрації перейдіть за посиланням "Підтвердити реєстрацію".

source: In reply to
uk: У відповідь на

source: Incomplete?
uk: Неповна реєстрація?

source: Info
uk: Інфо

source: Information about run
uk: Інформація про посилку

source: Information by your request is not available.
uk: Інформація за Вашим запитом відсутня.

source: Information is not available
uk: Інформація відсутня

source: Information is not available.
uk: Інформація відсутня.

source: Input
uk: Вхідні дані

source: Input file name
uk: Ім’я вхідного файла

source: Input format
uk: Формат вхідних даних

source: Input in
uk: Вхідні дані у файлі

source: Institution
uk: Навчальний заклад

source: Institution (En)
uk: Навчальний заклад (Англ.)

source: Institution (abbreviated)
uk: Навчальний заклад (абревіатура)

source: Institution (abbreviated) (En)
uk: Навчальний заклад (абревіатура) (Англ.)

source: Institution (short)
uk: Навчальний заклад (скор.)

source: Institution (short) (En)
uk: Навчальний заклад (скор.) (Англ.)

source: Institution entry date
uk: Дата вступу в навчальний заклад

source: Institution graduation date
uk: Дата випуску з навчального закладу

source: Institution number
uk: Номер навчального закладу

source: Instructions
uk: Інструкції

source: Insufficient duration to continue the contest
uk: Недостатня тривалість турніру

source: Internal error
uk: Внутрішня помилка

source: Invalid RunId %s in row %d
uk: Недопустиме значення RunId %s у рядку %d

source: Invalid UId %s in row %d
uk: Недопустиме значення UId %s у рядку %d

source: Invalid action
uk: Неправильна команда

source: Invalid character
uk: Недопустимий символ

source: Invalid characters
uk: Недопустимі символи

source: Invalid clar_id
uk: Неправильний ідентифікатор повідомлення

source: Invalid configuration
uk: Неправильна конфігурація

source: Invalid contest
uk: Неправильний турнір

source: Invalid cypher `%s' in row %d
uk: Недопустимий шифр `%s' у рядку %d

source: Invalid directory structure type
uk: Неправильний тип структури каталогів

source: Invalid duration specification
uk: Неправильно вказано тривалість турніру

source: Invalid error code
uk: Невірний код помилки

source: Invalid file name
uk: Неправильне ім’я файла

source: Invalid filter expression
uk: Неправильна умова фільтрування

source: Invalid language
uk: Неправильний ідентифікатор мови програмування

source: Invalid language `%s' in row %d
uk: Недопустима мова `%s' у рядку %d

source: Invalid locale_id
uk: Неправильний ідентифікатор мови

source: Invalid login
uk: Неправильний логін

source: Invalid login `%s' in row %d
uk: Недопустимий логін `%s' у рядку %d

source: Invalid name `%s' in row %d
uk: Недопустиме ім’я `%s' у рядку %d

source: Invalid pages count
uk: Неправильна кількість сторінок

source: Invalid parameter
uk: Некоректний параметр

source: Invalid problem
uk: Неправильна задача

source: Invalid problem `%s' in row %d
uk: Недопустима задача `%s' у рядку %d

source: Invalid problem in run %d in row %d
uk: Недопустима задача в посилці %d в рядку %d

source: Invalid role
uk: Неправильна роль користувача

source: Invalid run selection type
uk: Неправильний тип вибору посилок

source: Invalid run to compare to
uk: Неправильний номер посилки для порівняння

source: Invalid score
uk: Неправильні бали

source: Invalid score adjustment
uk: Неправильна корекція балів

source: Invalid session
uk: Неправильний ідентифікатор сесії

source: Invalid session identifier. The possible reasons are as follows.
uk: Неправильний ідентифікатор сесії. Можливі причини цієї помилки перераховано нижче.

source: Invalid status
uk: Недопустимий статус

source: Invalid status `%s' (%d) in row %d
uk: Недопустимий статус `%s' (%d) у рядку %d

source: Invalid status `%s' in row %d
uk: Недопустимий статус `%s' у рядку %d

source: Invalid test
uk: Неправильний тест

source: Invalid text of warning
uk: Недопустимий текст попередження

source: Invalid text of warning comment
uk: Неправильний текст коментаря до попередження

source: Invalid time specification
uk: Неправильно вказано час

source: Invalid user role
uk: Некоректна роль користувача

source: Invalid user_id
uk: Некоректний ідентифікатор користувача

source: Invalid user_login
uk: Некоректний логін користувача

source: Invalid variant
uk: Неправильний варіант

source: Invisible?
uk: Невидимий?

source: Issue a warning
uk: Видати попередження

source: Issue warning
uk: Видати попередження

source: It's not allowed to answer to judge's messages
uk: Не можна відповідати на повідомлення суддів

source: Jan
uk: Січ

source: Judge
uk: Суддя

source: Judge scores are opened
uk: Фінальні бали відкрито

source: Judge suspended runs
uk: Перевірити відкладені посилки

source: Judge suspended runs!
uk: Перевірити відкладені посилки!

source: Judge's comment
uk: Коментар для суддів

source: Judge's report
uk: Суддівський протокол

source: Judging priorities
uk: Пріоритет перевірки

source: Jul
uk: Лип

source: Jump to contest
uk: Перейти до контесту

source: Jump to group
uk: Перейти до групи

source: Jun
uk: Чер

source: Just OK the run
uk: Просто позначити посилку як OK

source: Just SUMMON the run
uk: Просто позначити посилку як SUMMONED

source: Just ignore the run
uk: Просто проігнорувати посилку

source: Keywords
uk: Ключові слова

source: Language
uk: Мова

source: Language %s is disabled for problem %s in row %d
uk: Мову програмування %s заборонено для задачі %s у рядку %d

source: Language %s is disabled in row %d
uk: Мову програмування %s заборонено в рядку %d

source: Language %s is not enabled for problem %s in row %d
uk: Мову програмування %s не дозволено для задачі %s у рядку %d

source: Language column is undefined
uk: Стовпець "Мова" не визначено

source: Language is empty in row %d
uk: У рядку %d не визначено мову

source: Language settings (serve.cfg)
uk: Налаштування мов програмування (serve.cfg)

source: Language statistics
uk: Статистика по мовам програмування

source: Last User_Id (incl.)
uk: Останній User_Id (вкл.)

source: Last clar
uk: Останнє повідомлення

source: Last login time
uk: Час останнього входу в турнір

source: Last run
uk: Остання посилка

source: Last submit
uk: Остання посилка

source: Last success
uk: Остання успішна здача

source: Link
uk: Посилання

source: Links
uk: Посилання

source: List of registered participants
uk: Список зареєстрованих учасників

source: Locale ID
uk: Ідентифікатор локалі

source: Locale code
uk: Код локалі

source: Location
uk: Розміщення

source: Lock
uk: Закрити

source: Locked?
uk: Закрито?

source: Log in
uk: Увійти

source: Log in to edit registration data
uk: Увійти й редагувати реєстраційні дані

source: Login
uk: Логін

source: Login contains invalid characters
uk: Поле "Логін" містить недопустимі символи

source: Login is empty in row %d
uk: У рядку %d не визначено логін

source: Login is not specified
uk: Поле "Логін" не заповнено

source: Login may contain only latin letters, digits, <tt>.</tt> (dot), <tt>-</tt> (minus sign), <tt>_</tt> (undescore).
uk: Логін може містити тільки латинські літери, цифри, знаки <tt>.</tt> (крапка), <tt>-</tt> (мінус), <tt>_</tt> (підкреслювання).

source: Login page
uk: Вхід до системи

source: Login successfull. Now entering the main page.
uk: Вхід успішно здійснено. Тепер переходимо до головної сторінки.

source: Logout
uk: Вийти з системи

source: Long name
uk: Назва задачі

source: Lost password recovery [%s]
uk: Відновлення пароля [%s]

source: Magistrant
uk: Студент магістратури

source: Main URL
uk: Головний URL

source: Main page
uk: Головна

source: Make invisible
uk: Зробити невидимою

source: Make visible
uk: Зробити видимою

source: Male
uk: Чол.

source: Mandatory
uk: Обов’язковий

source: Mar
uk: Бер

source: Mark BANNED
uk: Встановити атрибут ЗАБЛОКОВАНОСТІ

source: Mark INCOMPLETE
uk: Встановити атрибут НЕПОВНОТИ

source: Mark INVISIBLE
uk: Встановити атрибут НЕВИДИМОСТІ

source: Mark LOCKED
uk: Встановити ще один атрибут

source: Mark OK
uk: Дозволити участь

source: Mark PENDING
uk: Поставити на очікування

source: Mark REJECTED
uk: Відмовити в участі

source: Mark displayed runs
uk: Відмітити відображувані посилки

source: Marked?
uk: Відмічено?

source: Max memory used
uk: Макс. використовувана пам’ять

source: Max number of users was
uk: Макс. кількість користувачів була

source: Max problem submit count is exceeded
uk: Перевищено максимальну кількість посилок по задачі

source: Max. CPU time: %d.%03d
uk: Макс. час ЦП: %d.%03d

source: Max. CPU time: %d.%03d (time-limit exceeded)
uk: Макс. час ЦП: %d.%03d (перевищено)

source: Maximal random number
uk: Максимальне випадкове число

source: May
uk: Тра

source: May change!
uk: Може змінитись!

source: Memory limit
uk: Обмеження на пам’ять

source: Memory limit exceeded
uk: Перевищено обмеження на пам’ять

source: Merge runs in XML format
uk: Злити журнал посилок в XML-форматі
