Repository: arsijo/ejudge-translation
Catalog: ejudge.po
Languages: uk

source: Your have been banned by the administrator.
uk: Вашу участь заблоковано адміністратором системи.

source: Your registration has not been confirmed.
uk: Вашу реєстрацію на турнір не підтверджено.

source: Your request has caused an internal server error. Please, report it as a bug.
uk: Ваш запит спричинив внутрішню помилку сервера. Будь ласка, повідомте про цю помилку.

source: Your session has expired.
uk: Час сесії сплив.

source: Your submit has been commented
uk: Вашу посилку було прокоментовано

source: Your submit has been commented and accepted
uk: Вашу посилку було прокоментовано і прийнято

source: Your submit has been commented and ignored
uk: Вашу посилку було прокоментовано і проігноровано

source: Your submit has been commented and rejected
uk: Вашу посилку було прокоментовано і відхилено

source: Your submit has been commented and summoned for defence
uk: Вашу посилку було прокоментовано і Ви запрошені на захист

source: Your submit has been commented in contest %d
uk: Вашу посилку було прокоментовано в турнірі %d

source: Zip code
uk: Поштовий індекс

source: [Edit current contest]
uk: [Редагувати поточний контест]

source: `run_id' parameter is undefined
uk: Параметр `run_id' не визначено

source: `run_id' parameter value %d is out of range
uk: Значення параметра `run_id' %d за межами допустимих

source: `run_id' parameter value is invalid.
uk: Номер посилки %d некоректний.

source: `run_id' parameter value is out of range
uk: Значення параметра `run_id' %d за межами допустимих

source: accepting
uk: прийом розв’язків

source: access denied
uk: у доступі відмовлено

source: action is temporarily unavailable
uk: запит тимчасово не може бути виконано

source: all
uk: усі

source: allowed only in virtual contest
uk: дозволено тільки у віртуальних турнірах

source: bad XML
uk: некоректний XML

source: bad contest identifier
uk: неправильний ідентифікатор турніру

source: bad user identifier
uk: неправильний ідентифікатор користувача

source: cannot connect to the server
uk: немає зв’язку з сервером

source: clarification requests are disabled
uk: повідомлення відключено

source: clients suspended
uk: клієнти призупинені

source: contains invalid characters
uk: містить недопустимі символи

source: contest deadline exceeded
uk: реєстрацію на турнір завершено

source: conversion from string to bool failed
uk: перетворення з типу string у тип bool завершилося з помилкою

source: conversion from string to dur_t failed
uk: перетворення з типу string у тип dur_t завершилося з помилкою

source: conversion from string to hash_t failed
uk: перетворення з типу string у тип hash_t завершилося з помилкою

source: conversion from string to int failed
uk: перетворення з типу string у тип int завершилося з помилкою

source: conversion from string to ip_t failed
uk: перетворення з типу string у тип ip_t завершилося з помилкою

source: conversion from string to result_t failed
uk: перетворення з типу string у тип result_t завершилося з помилкою

source: conversion from string to time_t failed
uk: перетворення з типу string у тип time_t завершилося з помилкою

source: data format error
uk: помилка формату даних

source: database error
uk: помилка бази даних

source: division by zero
uk: ділення на нуль

source: duplicated submission
uk: повторне надсилання

source: e-mail sending failed
uk: надсилання ел. пошти завершилося невдало

source: error code 1
uk: помилка з кодом 1

source: finished
uk: завершено

source: frozen
uk: заморожено

source: generic server error
uk: невизначена помилка сервера

source: group with this name already exists
uk: група з такою назвою вже існує

source: in progress
uk: триває

source: incomplete registration
uk: неповна реєстрація

source: integer overflow
uk: цілочислове переповнення

source: invalid argument
uk: некоректний аргумент

source: invalid argument type
uk: некоректний тип аргументу

source: invalid clar_id
uk: некоректний ідентифікатор повідомлення

source: invalid contest duration
uk: некоректна тривалість турніру

source: invalid contest_id
uk: некоректний ідентифікатор турніру

source: invalid field
uk: некоректний ідентифікатор поля

source: invalid filter expression
uk: некоректна умова фільтрування

source: invalid group id
uk: некоректний ідентифікатор групи

source: invalid language
uk: некоректний ідентифікатор мови програмування

source: invalid login
uk: некоректний логін

source: invalid member
uk: некоректний участник

source: invalid password
uk: неправильний пароль

source: invalid prob_id
uk: некоректний ідентифікатор задачі

source: invalid run status
uk: некоректний статус посилки

source: invalid run_id
uk: некоректний номер посилки

source: invalid socket path
uk: неправильний шлях до сокета

source: invalid test number
uk: некоректний номер тесту

source: invalid user group
uk: некоректна група користувачів

source: invalid user_id
uk: неправильний ідентифікатор користувача

source: is available for this contest. Note, however, that simplified registration imposes certain restrictions on further use of the account!
uk: доступна для даного контесту. Зверніть увагу, що на використання облікових записів, створених по спрощеній процедурі, накладені певні обмеження!

source: is commented
uk: прокоментовано

source: judged
uk: розв’язки перевірено

source: judges
uk: судді

source: judging
uk: перевірка розв’язків

source: language
uk: мова

source: last 15
uk: останні 15

source: login already used
uk: логін зайнято

source: message subject is too long
uk: надто довга тема повідомлення

source: moderated
uk: модерована

source: ms
uk: мс

source: msec
uk: мс

source: must be specified
uk: має бути заповнено

source: no connection to server
uk: немає зв’язку з сервером

source: no error
uk: немає помилки

source: nonexistent cookie
uk: неіснуючий cookie

source: not connected to server
uk: немає зв’язку з сервером

source: not implemented
uk: не реалізовано

source: open
uk: відкрито

source: operation is not supported
uk: операція не підтримується

source: out of memory
uk: недостатньо пам’яті

source: packet receive failed
uk: одержання пакета завершилося невдало

source: packet sending failed
uk: надсилання пакета завершилося невдало

source: password
uk: пароль

source: peer closed connection
uk: сервер обірвав з’єднання

source: permission denied
uk: у доступі відмовлено

source: printing suspended
uk: друк призупинено

source: protocol error
uk: помилка протоколу

source: range error
uk: помилка діапазону

source: read error
uk: помилка зчитування

source: read error from server
uk: помилка зчитування даних від сервера

source: regular registration
uk: стандартна реєстрація

source: report is not available
uk: протокол не доступний

source: s
uk: с

source: some component of request is too large
uk: деякі компоненти запиту мають надто великий розмір

source: standings
uk: положення

source: submission log
uk: журнал посилок

source: system call failed
uk: системний виклик завершився невдало

source: team pages quota is exceeded
uk: перевищено квоту сторінок користувача

source: testing suspended
uk: тестування призупинено

source: the contest is already finished
uk: турнір уже завершено

source: the contest is already started
uk: турнір уже запущено

source: the contest is not finished
uk: турнір ще не завершився

source: the contest is not started
uk: турнір ще не розпочався

source: the program is already printed
uk: цю програму вже надруковано

source: the requested file does not exist
uk: запитаного файла не існує

source: the run is read-only
uk: цю посилку не може бути змінено

source: the session identifier is invalid
uk: недопустимий ідентифікатор сесії

source: the user quota is exceeded
uk: перевищено квоту користувача

source: there are transient runs
uk: наявні тимчасові посилки

source: this IP address is not allowed to use this service
uk: з даної IP-адреси заборонено використовувати цей сервіс

source: this field cannot be changed
uk: це поле не можна змінювати

source: this field cannot be deleted
uk: це поле не можна очищувати

source: this language is disabled for this problem
uk: цю мову не можна використовувати для цієї задачі

source: this user cannot participate in this contest
uk: цей користувач не може брати участі в цьому турнірі

source: this user is not registered for this contest
uk: цього користувача не зареєстровано на даний турнір

source: transitive user contest sharing
uk: транзитивний розподіл користувачів турніру

source: unexpected EOF
uk: несподіваний кінець файла

source: unexpected EOF from server
uk: несподіваний кінець файла від сервера

source: unknown error
uk: невідома помилка

source: unspecified error
uk: невстановлена помилка

source: user
uk: учасник

source: user is simple_registered
uk: користувача створено за спрощеною процедурою реєстрації

source: user tries to download runs too often
uk: користувач зачасто намагається вантажити свої посилки

source: user's runs downloading disabled
uk: завантаження користувацьких посилок заборонене

source: variant
uk: варіант

source: viewing report is disabled
uk: перегляд звітів відключено

source: viewing run source is disabled
uk: перегляд текстів програм відключено

source: write error
uk: помилка запису

source: write error to server
uk: помилка запису даних на сервер

source: [over]
uk: [завершено]

source: NOT STARTED
uk: НЕ ПОЧАВСЯ

source: RUNNING
uk: ТУРНІР ТРИВАЄ
