Repository: arsijo/ejudge-translation
Catalog: ejudge.po
Languages: uk

source: Set the INVISIBLE flag for the selected users
uk: Встановити атрибут НЕВИДИМОСТІ для відмічених користувачів

source: Set the LOCKED flag for the selected users
uk: Встановити атрибут LOCKED для відмічених користувачів

source: Set the registration status of the selected users to OK
uk: Встановити статус реєстрації в OK, тобто дозволити участь

source: Set the registration status of the selected users to PENDING
uk: Встановити статус реєстрації в PENDING, тобто відкласти рішення

source: Set the registration status of the selected users to REJECTED
uk: Встановити статус реєстрації в REJECTED, тобто відмовити в участі

source: Settings
uk: Налаштування

source: Shift parameter
uk: Параметр shift

source: Short name
uk: ID Задачі

source: Show closed contests
uk: Показувати закриті контести

source: Show hidden contests
uk: Показувати приховані контести

source: Show tests
uk: Дозволити перегляд згідно до правил видимості тестів

source: Show unmanageable contests
uk: Показати немодеровані контести

source: Shown
uk: Показано

source: Signal
uk: Сигнал

source: Simplified registration
uk: Спрощена реєстрація

source: Size
uk: Розмір

source: Skipped
uk: Пропущено

source: Solved
uk: Розв’язано

source: Solved<br/>problems
uk: Розв’язані<br/>задачі

source: Source
uk: Вихідний код

source: Source code
uk: Вихідний код

source: Source code is closed
uk: Перегляд вихідного коду закрито

source: Source code is open
uk: Перегляд вихідного коду відкрито

source: Source file does not exist
uk: Запитаного файла не існує

source: Source for run
uk: Код відправки

source: Source for this run is not available
uk: Текст для цієї посилки не доступний

source: Squeeze runs
uk: Стиснути журнал

source: Stack limit
uk: Обмеження розміру стека

source: Standings
uk: Положення

source: Standings [%s, frozen]
uk: Положення [%s, заморожені]

source: Standings [not started]
uk: Положення [не розпочато]

source: Standings [over, frozen]
uk: [завершено, заморожені]

source: Standings [over]
uk: Положення [завершено]

source: Standings freeze time
uk: Час заморожування таблиці результатів

source: Standings unfreeze time
uk: Час розморожування таблиці результатів

source: Start
uk: Почати

source: Start at
uk: Початок о

source: Start exam
uk: Розпочати екзамен

source: Start new
uk: Розпочати новий

source: Start new editing
uk: Розпочати нове редагування

source: Start upsolving
uk: Відкрити дорозв’язування

source: Start virtual contest
uk: Розпочати віртуальний турнір

source: Statement
uk: Умова

source: Statements
uk: Умови

source: Static priority
uk: Статичний пріоритет

source: Status
uk: Статус

source: Status is empty in row %d
uk: Статус не задано в рядку %d

source: Status of your submit %d is changed in contest %d
uk: Статус Вашої посилки %d було змінено в турнірі %d

source: Status of your submit is changed
uk: Статус Вашої посилки було змінено

source: Stop
uk: Зупинити

source: Stop exam
uk: Завершити екзамен

source: Stop upsolving
uk: Закрити дорозв’язування

source: Stop virtual contest
uk: Завершити віртуальний турнір

source: Street address
uk: Вулиця, будинок, квартира

source: Student
uk: Студент

source: Subject
uk: Тема

source: Subject is empty
uk: Тему повідомлення не задано

source: Subject length is too big
uk: Поле "Тема" має надто велику довжину

source: Subject length is too big (%zu)
uk: Поле "Тема" має надто велику довжину (%zu)

source: Submission log
uk: Журнал посилок

source: Submission time
uk: Час надсилання

source: Submissions
uk: Відправки

source: Submit
uk: Надіслати

source: Submit a solution
uk: Здати розв’язок

source: Submit a solution for
uk: Здати розв’язок задачі

source: Submit appeal
uk: Надіслати апеляцію

source: Submit clar
uk: Надіслати питання

source: Submit image
uk: Надіслати зображення

source: Submit solution!
uk: Здати розв’язок!

source: Submit source viewing is disabled
uk: Перегляд текстів програм відключено

source: Submit testing mode
uk: Увімкнути режим прийому розв’язків

source: Success
uk: Успішних

source: Summary
uk: Підсумок

source: Summoned for defence
uk: Викликаний на захист

source: Suspend clients
uk: Призупинити клієнтів

source: Suspend printing
uk: Призупинити друк розв’язків

source: Suspend testing
uk: Призупинити перевірку розв’язків

source: Switch language
uk: Перемкнути мову

source: Synchronization error
uk: Помилка синхронізації

source: System error
uk: Системна помилка

source: TESTING COMPLETED
uk: ТЕСТУВАННЯ ЗАВЕРШЕНО

source: TESTING IN PROGRESS...
uk: ТРИВАЄ ТЕСТУВАННЯ...

source: Team name
uk: Назва команди

source: Telegram Token
uk: Токен для Telegram

source: Terminate download
uk: Перервати загрузку

source: Test file does not exist
uk: Запитаного файла не існує

source: Test file is not available
uk: Тест не доступний

source: Test information
uk: Інформація про тест

source: Test input
uk: Вхідні дані

source: Test input data
uk: Вхідні дані

source: Test number
uk: Номер тесту

source: Testing comments
uk: Коментарі щодо тестування

source: Testing is in progress...
uk: Триває перевірка відповідей...

source: Testing messages
uk: Повідомлення при тестуванні

source: Testing of participants' submits is suspended
uk: Перевірку розв’язків учасників призупинено

source: Testing queue
uk: Черга тестування

source: Testing reports are closed
uk: Перегляд звітів закрито

source: Testing reports are open
uk: Перегляд звітів відкрито

source: Tests
uk: Тести

source: Tests is empty in row %d
uk: Тести не задано в рядку %d

source: Tests passed
uk: Пройдено тестів

source: Tests value `%s' is invalid in row %d
uk: Значення тестів `%s' недопустиме в рядку %d

source: The account parameters are as follows:
uk: Ваш реєстраційний запис має такі параметри:

source: The contest is closed for participation.
uk: Турнір закрито для участі.

source: The contest is in progress
uk: Турнір триває

source: The contest is in progress (standings are frozen)
uk: Турнір триває (поточне положення заморожене)

source: The contest is not started
uk: Турнір не розпочався

source: The contest is over
uk: Турнір завершився

source: The contest is over (standings are frozen)
uk: Турнір завершився (поточне положення заморожене)

source: The contest is personal
uk: Контест особистий

source: The contest is temporarily not available. Please, retry the request a bit later.
uk: У даний момент турнір тимчасово не доступний. Спробуйте повторити запит трохи пізніше.

source: The exam is in progress
uk: Екзамен триває

source: The exam is in progress (standings are frozen)
uk: Екзамен триває (поточне положення заморожене)

source: The exam is not started
uk: Екзамен не розпочався

source: The exam is over
uk: Екзамен завершився

source: The exam is over (standings are frozen)
uk: Екзамен завершився (поточне положення заморожене)

source: The language %s is disabled for this problem
uk: Мова %s заборонена для цієї задачі

source: The language is disabled for this problem
uk: Мова заборонена для цієї задачі

source: The problem statement is not available
uk: Умова задачі не доступна

source: The server is down. Try again later.
uk: Сервер не працює. Будь ласка, повторіть операцію пізніше.

source: The server was unable to send a registration e-mail to the specified address. This is probably due to heavy server load rather than to an invalid e-mail address. You should try to register later.
uk: Сервер виявився неспроможним надіслати реєстраційного листа на вказану адресу. Це, можливо, відбулося через надто високу завантаженість сервера, а не через неправильну ел. адресу. Повторіть спробу реєстрації пізніше.

source: The session was created from a different IP-address or protocol, that yours.
uk: Сесію було створено з іншої адреси чи протоколу, ніж ті, якими Ви користуєтесь зараз.

source: The session was removed by an administrator.
uk: Сесію було видалено адміністратором системи.

source: The specified session does not exist.
uk: Вказаної сесії не існує.

source: The specified session has expired.
uk: Час сесії сплив.

source: The submission is binary and thus is not shown.
uk: Відправка не є текстовим файлом і тому не показана.

source: The user database server is currently not available. Please, retry the request later.
uk: Сервер бази даних користувачів у даний момент не доступний. Спробуйте повторити запит пізніше.

source: This contest cannot be continued
uk: Цей турнір не може бути продовжено

source: This contest operates in "simplified registration" mode. You will get your login and password immediately after account is created.
uk: У цьому турнірі діє спрощена процедура реєстрації. Ви отримаєте пароль від свого облікового запису відразу після його створення (без використання ел. пошти).

source: This contest operates in \"simplified registration\" mode. You will get your login and password immediately after account is created.
uk: У цьому турнірі діє спрощена процедура реєстрації. Ви отримаєте пароль від свого облікового запису відразу після його створення (без використання ел. пошти).

source: This language is disabled for use
uk: Цю мову не може бути використано для даної задачі

source: This language is not available for this problem
uk: Мова не доступна для цієї задачі

source: This message contains the login name, assigned to you, as well as your password for initial log in. You will be able to change the password later.
uk: На Вашу ел. адресу буде надіслано листа, що міститиме логін і пароль для входу в систему. Цей пароль необхідно використати для першого входу в систему, після чого його можна буде змінити.

source: This message contains the password for the initial log in. You will be able to change the password later.
uk: На Вашу ел. адресу буде надіслано листа, який міститиме пароль для входу в систему. Цей пароль необхідно використати для першого входу в систему, після чого його можна буде змінити.

source: This problem is already solved
uk: Цю задачу вже вирішено

source: This problem is not yet available
uk: Ця задача ще не доступна

source: This program is configured incorrectly and cannot perform normal operation. Please contact the site (or contest) administrator.
uk: Ця програма сконфігурована неправильно й не може працювати. Будь ласка, зверніться до адміністратора сайта чи турніру.

source: This submit is already printed
uk: Цю програму вже надруковано

source: This submit is duplicate of another run
uk: Ця посилка є копією іншої посилки

source: This submit is duplicate of the run %d
uk: Ця посилка є копією посилки %d

source: This test program is correct, but failed on some tests
uk: Ця тестова програма коректна, але не проходить деякі тести

source: This test program is incorrect, but passed all tests
uk: Ця тестова програма некоректна, але проходить усі тести

source: Time
uk: Час

source: Time (sec)
uk: Час (с)

source: Time expression
uk: Умова часу

source: Time limit
uk: Обмеження на час

source: Time-limit exceeded
uk: Перевищено максимальний час роботи

source: Timestamp
uk: Відмітка часу

source: To
uk: Кому

source: To confirm password regeneration, you should visit the following URL: %s?contest_id=%d&locale_id=%d&SID=%016llx&action=%d.
uk: Щоб згенерувати новий випадковий пароль, ви маєте відкрити такий URL: %s?contest_id=%d&locale_id=%d&SID=%016llx&action=%d.

source: To contest details
uk: До деталей контесту

source: To contests list
uk: До списку контестів

source: To create an account, please think out, a login and provide your valid e-mail address in the form above. Then press the \"Create account\" button.
uk: Щоб створити обліковий запис, придумайте собі логін, уведіть його та Вашу актуальну ел. адресу в форму зверху та натисніть на кнопку "Створити обліковий запис".

source: To main page
uk: На головну сторінку

source: To the top
uk: Догори

source: To the top (postpone editing)
uk: Догори (відкласти редагування)

source: To user id
uk: Кому (реєстр. номер)

source: To user login
uk: Кому (реєстр. ім’я)

source: To validate your e-mail and enable your participation in this contest you may use the password recovery link below.
uk: Для перевірки Вашої ел. адреси й допуску Вашого реєстраційного запису до участі в цьому турнірі Ви можете скористатися послугою відновлення пароля.

source: Token counter
uk: Кількість використаних токенів

source: Tokenize displayed runs
uk: Редагувати токени відображених відправок

source: Tokenize displayed runs!
uk: Редагувати токени відображених відправок!

source: Too few lines in CSV file
uk: У CSV-файлі замало рядків

source: Total
uk: Усього

source: Total messages
uk: Усього повідомлень

source: Total number of sample programs in the test suite
uk: Загальна кількість тестових програм

source: Total number of submitted tests
uk: Загальна кількість запропонованих тестів

source: Total priority
uk: Сумарний пріоритет

source: Total score
uk: Сумарний бал

source: Total size of Clars
uk: Сумарний розмір питань

source: Total size of Runs
uk: Сумарний розмір посилок

source: Total submissions
uk: Усього посилок

source: Try again this operation later
uk: Повторіть операцію пізніше

source: Type the login and the password in to the form above and press the "Log in" button to activate the account.
uk: Введіть Ваш логін та пароль у форму зверху та натисніть кнопку «Увійти» для активації облікового запису.

source: UId is empty in row %d
uk: Поле UId порожнє в рядку %d

source: UPSOLVING
uk: ДОРОЗВ’ЯЗУВАННЯ

source: Unanswered clars
uk: Повідомлення без відповіді

source: Undefined user_id and login
uk: Не визначено ні user_id, ні login

source: Unexpected EOF
uk: Несподіваний кінець файла

source: Unhandled action
uk: Неопрацьована операція

source: Unhandled action: %d
uk: Неопрацьована операція: %d

source: Unknown error
uk: Невідома помилка

source: Unknown error %d
uk: Невідома помилка %d

source: Unknown error %d.
uk: Невідома помилка %d.

source: Unlimited
uk: Не обмежено

source: Unlock
uk: Відкрити

source: Unmark displayed runs
uk: Зняти відмітки з відображених посилок

source: Up all
uk: Усі догори

source: Update public standings
uk: Оновити публічну таблицю становища учасників

source: Update standings!
uk: Оновити таблицю!

source: Update the public standings
uk: Оновити публічну таблицю становища учасників

source: Update versions
uk: Оновити версії

source: Upload avatar
uk: Загрузити аватар

source: Upload judging protocol
uk: Установити протокол тестування

source: Upload!
uk: Установити!

source: Upsolving
uk: Дорозв’язування

source: Upsolving configuration
uk: Конфігурації дорішування

source: Upsolving mode
uk: Режим дорозв’язування

source: Use 'extid' as problem name
uk: Використати параметр ‚extid’ як назву задачі

source: Use 'problem_dir' as problem name
uk: Використати параметр ‚problem_dir’ як назву задачі

source: Use Contest Id
uk: Використати ID контесту

source: Use an existing account
uk: Використати наявний обліковий запис

source: Use existing contest:
uk: Використати наявний контест:

source: Use problem short name
uk: Використати коротку назву задачі

source: Use programming language short name
uk: Використати коротку назву мови програмування

source: Use run number
uk: Використати номер посилки

source: Use source language or content type suffix
uk: Використати суфікс мови або типу файла

source: Use submit time
uk: Використати час відправки

source: Use token
uk: Відкрити протокол

source: Use user Id
uk: Використати ідентифікатор користувача

source: Use user Login
uk: Використати логін користувача

source: Use user Name
uk: Використати ім’я учасника

source: User
uk: Учасник

source: User <tt>%s</tt> does not exist
uk: Користувача <tt>%s</tt> не існує

source: User ID
uk: Id

source: User Id
uk: Id користувача

source: User Id %d does not exist
uk: Користувача з номером %d не існує

source: User Id does not exist
uk: Користувача не існує

source: User Login
uk: Логін

source: User Name
uk: Ім’я учасника

source: User database server is down
uk: Сервер бази користувачів недоступний

source: User does not exist
uk: Користувача не існує

source: User filter expression
uk: Умова фільтрування учасників

source: User info
uk: Інформація про користувача

source: User is simple registered
uk: Користувача створено за спрощеною процедурою реєстрації

source: User login
uk: Логін команди

source: User login page
uk: Вхід до системи

source: User login/ID
uk: Login/ID користувача

source: User mode
uk: Режим учасника

source: User name
uk: Ім’я учасника

source: User name (for standings)
uk: Ім’я учасника (для таблиці результатів)

source: User quota exceeded. This clarification request is too large, you already have too many clarification requests, or the total size of your clarification requests is too big
uk: Перевищено квоту користувача на повідомлення. Дане повідомлення надто велике, або Ви вже надіслали занадто багато повідомлень, або сумарний розмір усіх Ваших повідомлень надто великий

source: User quota exceeded. This submit is too large, you already have too many submits, or the total size of your submits is too big
uk: Перевищено квоту користувача. Дана посилка має надто великий розмір, або Ви здійснили занадто багато посилок, або сумарний розмір Ваших посилок надто великий

source: User report
uk: Користувацький протокол

source: User standings
uk: Положення учасників

source: User's report
uk: Користувацький протокол

source: Userlist server is down
uk: Сервер бази користувачів недоступний

source: Users
uk: Учасники

source: Users for IP addresses
uk: Користувачі IP-адрес

source: Users page
uk: Список учасників

source: Value of field "%s" is invalid.
uk: Значення поля "%s" некоректне.

source: Valuer comments
uk: Коментарі оцінювання

source: Valuer errors
uk: Помилки при оцінюванні

source: Valuer information
uk: Інформація про оцінювання

source: Valuer judge comments
uk: Коментар про оцінювання для суддів

source: Valuer judge comments are displayed
uk: Показуєтся коментар оцінювання для суддей

source: Variant
uk: Варіант

source: Variants (variant.map)
uk: Варіант (variant.map)

source: View
uk: Перегляд

source: View all
uk: Переглянути все

source: View check details
uk: Звіт щодо перевірки

source: View contest passwords
uk: Переглянути турнірні паролі

source: View details
uk: Подивитись деталі

source: View last 15
uk: Дивитися останні 15

source: View registration passwords
uk: Переглянути реєстраційні паролі

source: View regular users
uk: Переглянути список звичайних користувачів

source: View report
uk: Переглянути протокол

source: View serve.cfg
uk: Подивитись serve.cfg

source: View source
uk: Переглянути вихідний текст

source: View submitted answer
uk: Надіслана відповідь

source: View the problem statement and send a submission
uk: Переглянути умову задачі та надіслати розв’язок

source: Viewing advisors
uk: Перегляд керівників

source: Viewing audit log for
uk: Перегляд журналу аудиту для

source: Viewing clar
uk: Перегляд повідомлення

source: Viewing coaches
uk: Перегляд тренерів

source: Viewing contestants
uk: Перегляд учасників

source: Viewing general info
uk: Перегляд загальної інформації

source: Viewing guests
uk: Перегляд гостів

source: Viewing report
uk: Перегляд протоколу

source: Viewing reserves
uk: Перегляд запасних

source: Viewing run
uk: Перегляд посилки

source: Viewing settings
uk: Перегляд налаштувань

source: Viewing user report
uk: Перегляд користувацького протоколу

source: Virtual contest close date
uk: Час закриття віртуального контесту

source: Virtual contest close time
uk: Час закриття віртуального турніру

source: Virtual contest is not started
uk: Віртуальний турнір не розпочато

source: Virtual contest open date
uk: Час відкриття віртуального контесту

source: Virtual contest open time
uk: Час відкриття віртуального турніру

source: Virtual start
uk: Початок віртуального турніру

source: Virtual start failed
uk: Віртуальний турнір не може бути розпочато

source: Virtual stop
uk: Завершення віртуального турніру

source: Wall time-limit exceeded
uk: Перевищено обмеження на реальний час роботи

source: Warning explanation for the user (mandatory)
uk: Пояснення для учасника (обов’язково)

source: Warning text for the user
uk: Текст попередження для користувача

source: Warnings
uk: Попередження

source: Write error
uk: Помилка запису

source: Write runs in XML internal format
uk: Зберегти журнал посилок у внутрішньому XML-форматі

source: Write runs in XML internal format with source
uk: Зберегти у внутрішньому XML-форматі журнал посилок з вихідними кодами

source: Wrong answer
uk: Неправильна відповідь

source: Wrong output format
uk: Неправильний формат відповіді

source: XML parse error
uk: Помилка розбору XML

source: YES
uk: ТАК

source: Yes
uk: Так

source: Yes.
uk: Так.

source: You are disqualified
uk: Вас дискваліфіковано

source: You are disqualified by the contest administration.
uk: Вас дискваліфіковано адміністрацією турніру.

source: You are not registered for this contest.
uk: Ви не зареєстровані на цей контест.

source: You cannot participate in the contest because your registration is incomplete.
uk: Ви не можете брати участь у турнірі, оскільки не заполнили до кінця поля реєстраційної анкети.

source: You cannot participate in this contest. Your account was created using the simple registration procedure, i.e. your e-mail address was not verified. This contest requires e-mail verification, so your account cannot be accepted.
uk: Ви не можете брати участі в цьому турнірі. Ваш реєстраційний запис було створено за спрощеною процедурою реєстрації, тобто Ваша ел. адреса не проходила перевірки. Цей турнір вимагає перевірених ел. адрес, тому Ваш реєстраційний запис не може бути допущено до участі.

source: You do not have permissions to use this service
uk: У Вас немає прав використовувати даний сервіс

source: You do not have permissions to use this service.
uk: У Вас немає прав використовувати даний сервіс.

source: You have been registered
uk: Вас успішно зареєстровано

source: You have no permissions to view this contest.
uk: У Вас немає прав переглядати даний турнір.

source: You have received a message from judges
uk: Ви отримали повідомлення від суддів

source: You have received a message from judges in contest %d
uk: Ви отримали повідомлення від суддів у турнірі %d

source: You have received a reply from judges
uk: Ви отримали відповідь від суддів

source: You have received a reply from judges in contest %d
uk: Ви отримали відповідь від суддів у турнірі %d

source: You have typed an invalid or non-existing login.
uk: Неправильно вказано логін.

source: You have typed an invalid or wrong password.
uk: Неправильно вказано пароль.

source: You must set up new password!
uk: Ви повинні задати новий пароль!

source: You should receive an e-mail message with a login and a password to the system. Use this password for the first log in. After the first login you will be able to change the password.
uk: На Вашу ел. адресу буде надіслано листа, що міститиме логін і пароль для входу в систему. Цей пароль необхідно використати для першого входу в систему, після чого його можна буде змінити.

source: You should receive an e-mail message with a password to the system. Use this password for the first log in. After the first login you will be able to change the password.
uk: На Вашу ел. адресу буде надіслано листа, який міститиме пароль для входу в систему. Цей пароль необхідно використати для першого входу в систему, після чого його можна буде змінити.

source: You will need to specify this token when interacting with Ejudge Telegram Bot. This token is valid for 300 seconds. The token is good for one Ejudge Bot interaction.
uk: Вам потрібно буде вказати цей токен при взаємодії з ботом Ejudge для Telegram. Токен діє 300 секунд та одну операцію.

source: Your IP-address or protocol is banned.
uk: Заборонена участь з даної IP-адреси або по даному протоколу.

source: Your Telegram token:
uk: Ваш токен для Telegram:
