Repository: arsijo/ejudge-translation
Catalog: ejudge.po
Languages: uk

source: %d total tests runs, %d passed, %d failed.
uk: Усього тестів: %d, пройдено: %d, не пройдено: %d.

source: (%d of %d)
uk: (%d з %d)

source: (%d token(s) used)
uk: (%d токен(ів) використано)

source: / <b>%d unread message(s)</b>
uk: / <b>%d непрочитаних повідомлень</b>

source: or standard input
uk: або стандартний ввід

source: or standard output
uk: або стандартний вивід

source: (no subject)
uk: (без теми)

source: , REGISTRATION DATA INCOMPLETE
uk: , РЕЄСТРАЦІЙНІ ДАНІ НЕПОВНІ

source: /&lt;Problem&gt;/&lt;File&gt;
uk: /&lt;Задача&gt;/&lt;Файл&gt;

source: /&lt;Problem&gt;/&lt;User_Id&gt;/&lt;File&gt;
uk: /&lt;Задача&gt;/&lt;Id_Корист.&gt;/&lt;Файл&gt;

source: /&lt;Problem&gt;/&lt;User_Login&gt;/&lt;File&gt;
uk: /&lt;Задача&gt;/&lt;Логін_Корист.&gt;/&lt;Файл&gt;

source: /&lt;Problem&gt;/&lt;User_Name&gt;/&lt;File&gt;
uk: /&lt;Задача&gt;/&lt;Ім’я_Корист.&gt;/&lt;Файл&gt;

source: /&lt;User_Id&gt;/&lt;File&gt;
uk: /&lt;Id_Корист.&gt;/&lt;Файл&gt;

source: /&lt;User_Id&gt;/&lt;Problem&gt;/&lt;File&gt;
uk: /&lt;Id_Корист.&gt;/&lt;Задача&gt;/&lt;Файл&gt;

source: /&lt;User_Login&gt;/&lt;File&gt;
uk: /&lt;Логін_Корист.&gt;/&lt;Файл&gt;

source: /&lt;User_Login&gt;/&lt;Problem&gt;/&lt;File&gt;
uk: /&lt;Логін_Корист.&gt;/&lt;Задача&gt;/&lt;Файл&gt;

source: /&lt;User_Name&gt;/&lt;File&gt;
uk: /&lt;Ім’я_Корист.&gt;/&lt;Файл&gt;

source: /&lt;User_Name&gt;/&lt;Problem&gt;/&lt;File&gt;
uk: /&lt;Ім’я_Корист.&gt;/&lt;Задача&gt;/&lt;Файл&gt;

source: <b>====== Test #%d =======</b>
uk: <b>====== Тест #%d =======</b>

source: <b>Note</b>, that you must log in 24 hours after the form is filled and submitted, or your registration will be cancelled!
uk: <b>Зверніть увагу</b>, що Ви повинні зайти в систему протягом 24 годин з моменту, коли заповните й надішлете анкету, інакше Вашу реєстрацію буде скасовано!

source: <b>Note</b>, that you should log in to the system for the first time no later, than in 24 hours after this moment, or the new account is removed.
uk: <b>Зверніть увагу</b>, що Ви повинні зайти в систему протягом 24 годин з цього моменту, інакше Ваш акаунт буде видалено.

source: <big>%d total tests runs, %d passed, %d failed.<br/>
uk: <big>Усього тестів: %d, пройдено: %d, не пройдено: %d.<br/>

source: <big>%d total tests runs, %d passed, %d failed.<br>
uk: <big>Усього тестів: %d, пройдено: %d, не пройдено: %d.<br>

source: <big>Failed test: %d.<br/><br/></big>
uk: <big>Помилка на тесті %d.<br/><br/></big>

source: <big>Failed test: %d.<br><br></big>
uk: <big>Помилка на тесті %d.<br><br></big>

source: <font color="magenta">Pending</font>
uk: <font color="magenta">Очікує підтвердження</font>

source: <font color="red">Rejected</font>
uk: <font color="red">Відмовлено</font>

source: <i>Command line is too long</i>
uk: <i>Командний рядок надто довгий</i>

source: <i>Invalid answer: %d</i>
uk: <i>Недопустима відповідь: %d</i>

source: <i>Not set</i>
uk: <i>Не встановлено</i>

source: <p class="ejudge_copyright">This is <a href="%s"><b>ejudge</b></a> contest administration system, version %s, compiled %s.</p> <p class="ejudge_copyright">This program is copyright &copy; %s Alexander Chernov.</p> <p class="ejudge_copyright">This program is free software; you can redistribute it and/or modify it under the terms of the <a href="http://www.gnu.org/licenses/gpl.html">GNU General Public License</a> as published by the <a href="http://www.fsf.org">Free Software Foundation</a>; either version 2 of the License, or (at your option) any later version.</p>
uk: <p class="ejudge_copyright">Це &mdash; система адміністрування турнірів <a href="%s"><b>ejudge</b></a>, версія %s, дата компіляції %s.</p> <p class="ejudge_copyright">Авторські права на програму: &copy; %s Олександр Чернов.</p> <p class="ejudge_copyright">Ця програма є вільним ПЗ. Ви можете розповсюджувати та/або модифікувати її у відповідності до <a href="http://www.gnu.org/licenses/gpl.html">Відкритої ліцензійної угоди GNU</a> (GNU General Public License), опублікованої <a href="http://www.fsf.org">Фондом вільного ПЗ</a> (Free Software Foundation), або версії 2 Ліцензії, або (за Вашим бажанням) будь-якої наступної версії.</p>

source: <p class="fixed_width">First stage of password recovery is successful. You should receive an e-mail message with further instructions. <b>Note,</b> that you should confirm password recovery in 24 hours, or operation will be cancelled.</p>
uk: <p class="fixed_width">Перший етап відновлення пароля завершено. Тепер Ви маєте отримати електронного листа з подальшими інструкціями. <b>Зверніть увагу,</b> що Ви повинні завершити процедуру відновлення пароля протягом 24 годин від цього моменту, інакше операцію буде скасовано.</p>

source: <p class="fixed_width">Password recovery requires several steps. Now, please, specify the <b>login</b> and the <b>e-mail</b>, which was specified when the login was created.</p> <p class="fixed_width">Note, that automatic password recovery is not possible for invisible, banned, locked, or privileged users!</p>
uk: <p class="fixed_width">Відновлення пароля виконується у кілька етапів. Зараз, будь ласка, вкажіть <b>логін</b> та <b>ел. адресу</b>, яку було використано при створенні цього логіну.</p> <p class="fixed_width">Зверніть увагу, що автоматичне відновлення пароля неможливе для заблокованих, невидимих та привілейованих користувачів!</p>

source: <p%s>New account <tt>%s</tt> is successfully created. Initial password is generated automatically. You will be able to change your password later.
uk: <p%s>Новий обліковий запис <tt>%s</tt> успішно створено. Початковий пароль для входу згенеровано автоматично. Ви зможете змінити його після входу в систему.

source: <p%s>Page %d of %d.</p>
uk: <p%s>Сторінка %d із %d.</p>

source: <p><font color="red">At least %d examiners must be assigned.</font></p>
uk: <p><font color="red">Має бути призначено принаймні %d екзаменаторів.</font></p>

source: <p><font color="red">Maximal number for this contest is %d, but already %d are defined.</font></p>
uk: <p><font color="red">Максимальна кількість учасників для цього турніру дорівнює %d, але вже визначено %d.</font></p>

source: <p><font color="red">Minimal number for this contest is %d, but only %d are defined.</font></p>
uk: <p><font color="red">Мінімальна кількість членів команди в цьому турнірі — %d, але визначено лише %d.</font></p>

source: <p>You may define up to %d members.</p>
uk: <p>Ви можете додати до %d членів команди.</p>

source: <tr%s><td colspan="2">Page %d of %d.</td></tr>
uk: <tr%s><td colspan=“2”>Сторінка %d з %d.</td></tr>

source: <u>--- Checker output: file is binary, size %lld ---</u>
uk: <u>--- Виведення чекера: бінарний файл, розмір &mdash; %lld —</u>

source: <u>--- Checker output: file is too large, original size %lld ---</u>
uk: <u>--- Виведення чекера: файл занадто великий, розмір &mdash; %lld ---</u>

source: <u>--- Checker output: size %lld ---</u>
uk: <u>--- Виведення чекера: розмір &mdash; %lld —</u>

source: <u>--- Command line arguments ---</u>
uk: <u>--- Аргументи командного рядка ---</u>

source: <u>--- Correct: file is binary, size %lld ---</u>
uk: <u>--- Правильна відповідь: файл бінарний, розмір &mdash; %lld ---</u>

source: <u>--- Correct: file is too large, original size %lld ---</u>
uk: <u>— Правильна відповідь: файл занадто великий, розмір &mdash; %lld —</u>

source: <u>--- Correct: size %lld ---</u>
uk: <u>--- Правильна відповідь: розмір &mdash; %lld ---</u>

source: <u>--- Input: file is binary, size %lld ---</u>
uk: <u>--- Вхідні дані: файл бінарний, розмір &mdash; %lld —</u>

source: <u>--- Input: file is too large, original size %lld ---</u>
uk: <u>— Вхідні дані: файл занадто великий, розмір &mdash; %lld —</u>

source: <u>--- Input: size %lld ---</u>
uk: <u>— Вхідні дані: розмір &mdash; %lld —</u>

source: <u>--- Output: file is binary, size %lld ---</u>
uk: <u>--- Вихідні дані: файл бінарний, розмір &mdash; %lld —</u>

source: <u>--- Output: file is too large, original size %lld ---</u>
uk: <u>— Вихідні дані: файл занадто великий, розмір &mdash; %lld —</u>

source: <u>--- Output: size %lld ---</u>
uk: <u>— Вихідні дані: розмір &mdash; %lld —</u>

source: <u>--- Stderr: file is binary, size %lld ---</u>
uk: <u>--- Помилки: файл бінарний, розмір &mdash; %lld —</u>

source: <u>--- Stderr: file is too large, original size %lld ---</u>
uk: <u>— Помилки: файл занадто великий, розмір &mdash; %lld —</u>

source: <u>--- Stderr: size %lld ---</u>
uk: <u>— Помилки: розмір &mdash; %lld —</u>

source: ALL PREVIOUS SUBMITS WILL BE LOST!
uk: ВСІ ПОПЕРЕДНІ ПОСИЛКИ БУДУТЬ ВТРАЧЕНІ!

source: Accepted for testing
uk: Прийнято до перевірки

source: Access denied
uk: У доступі відмовлено

source: Accounts created using simplified registration procedure cannot be used for participation in contests, which do not allow simplified registration. If you want a regular account, you may create an account using the
uk: Облікові записи, створені за спрощеною процедурою, не можуть бути використані для участі в турнирах, у яких не підтримується спрощена реєстрація. Якщо ж Ви хочете створити обліковий запис без обмежень на подальше використання, скористайтесь опцією

source: Actions
uk: Дії

source: Activate
uk: Активувати

source: Activate new user account
uk: Активувати новий обліковий запис

source: Add
uk: Додати

source: Add CHIEF EXAMINER
uk: Додати роль ГОЛОВНОГО ЕКЗАМЕНАТОРА

source: Add COORDINATOR
uk: Додати роль КООРДИНАТОРА

source: Add EXAMINER
uk: Додати роль ЕКЗАМЕНАТОРА

source: Add OBSERVER
uk: Додати роль СПОСТЕРІГАЧА

source: Add Review Comment
uk: Додати коментар code review до задачі

source: Add a new run comment
uk: Надіслати коментар до посилки

source: Add a new user specifying his/her User Id
uk: Додати нового користувача шляхом вказання User Id

source: Add a new user specifying his/her login
uk: Додати нового користувача шляхом вказання логіна

source: Add a permanent problem review comment
uk: Додати коментар code review до задачі

source: Add by ID
uk: Додати за ID

source: Add by login
uk: Додати за LOGIN

source: Add new
uk: Додати

source: Add new run
uk: Додати нову посилку

source: Add new runs in CSV format
uk: Додати нові записи в CSV-форматі

source: Add new user
uk: Додати нового користувача

source: Add run
uk: Додати нову посилку

source: Add runs in CSV format
uk: Додати записи в CSV-форматі

source: Add runs in CSV format!
uk: Додати записи в CSV-форматі!

source: Add the CHIEF EXAMINER role to the selected users
uk: Дозволити роботу в ролі ГОЛОВНОГО ЕКЗАМЕНАТОРА відміченим користувачам

source: Add the COORDINATOR role to the selected users
uk: Дозволити роботу в ролі КООРДИНАТОРА відміченим користувачам

source: Add the EXAMINER role to the selected users
uk: Дозволити роботу в ролі ЕКЗАМЕНАТОРА відміченим користувачам

source: Add the OBSERVER role to the selected users
uk: Дозволити роботу в ролі СПОСТЕРІГАЧА відміченим користувачам

source: Add users to another group
uk: Додати користувачів до іншої групи

source: Adding new runs
uk: Додавання нових посилок

source: Adding role %d to user %d in contest %d failed
uk: Додати роль %d користувачу %d в турнірі %d не вдалося

source: Adding role to user in contest failed
uk: Додати роль користувачу в турнірі не вдалося

source: Additional information about this error:
uk: Додаткова інформація про цю помилку:

source: Additional test information
uk: Дод. інф. про тест

source: Administrator
uk: Адміністратор

source: Advisor
uk: Керівник команди

source: Advisors
uk: Керівники

source: All changes to the old contest will be lost!
uk: Усі зміни до старого контеста будуть втрачені!

source: All clars
uk: Усі повідомлення

source: All clars and comments
uk: Усі повідомлення та коментарі

source: All entries
uk: Усі записи

source: Allow
uk: Дозволити

source: Allow edit registration data during contest
uk: Дозволити редагування реєстраційних данних під час контесту

source: Allow viewing full protocol
uk: Дозволити перегляд повного протоколу

source: Allow viewing run report
uk: Дозволити перегляд стислого протоколу

source: Allow viewing source code
uk: Дозволити перегляд вихідного тексту

source: Allow viewing the final scores
uk: Дозволити перегляд результатів

source: Allow viewing the judge comment of the valuer
uk: Дозволити перегляд коментаря для суддей, отриманого від програми оцінювання

source: An e-mail messages is sent to the address <tt>%s</tt>.
uk: Листа з параметрами Вашого облікового запису надіслано на адресу <tt>%s</tt>.

source: An e-mail with your account parameters is sent to address <tt>%s</tt>.
uk: Листа з параметрами Вашого облікового запису надіслано на адресу <tt>%s</tt>.

source: An email message will be sent to you just for your convenience.
uk: Задля Вашої зручності Вам буде надіслано листа з реєстраційними даними.

source: Answer
uk: Відповідь

source: Answer code
uk: Код відповіді

source: Answer is empty
uk: Відповідь порожня

source: Answer is unspecified
uk: Відповідь не задано

source: Answer text
uk: Текст відповіді

source: Appeals are disabled
uk: Апеляції відключено

source: Appeals deadline is exceeded
uk: Прийом апеляцій припинено

source: Apr
uk: Кві

source: Archive creation with tar failed
uk: Під час створення архіву програмою tar виникла помилка

source: Area
uk: Район

source: Assign automatically
uk: Призначити автоматично

source: Assign chief examiner
uk: Призначити старшого екзаменатора

source: Assign cyphers
uk: Призначити шифри

source: Assign examiner
uk: Призначити екзаменатора

source: Assign manually:
uk: Призначити вручну:

source: Assign random cyphers
uk: Призначити випадковий шифр

source: Assigned cyphers
uk: Призначені шифри

source: Attempt to submit a binary file
uk: Спроба надіслати бінарний файл

source: Audit log
uk: Журнал аудиту

source: Audit log file does not exist
uk: Журналу аудиту не існує

source: Audit log is empty
uk: Журнал аудиту порожній

source: Aug
uk: Сер

source: Author
uk: Автор

source: Auto-assign logins
uk: Призначити логіни автоматично

source: Available
uk: Доступна

source: Available only after contest start
uk: Доступний лише після початку турніру

source: Avatar
uk: Аватар

source: Back
uk: Назад

source: Background jobs
uk: Фоновні завдання

source: Bad socket name
uk: Неправильний шлях до сокета

source: Ban
uk: Заблокувати

source: Banned?
uk: Заблокований?

source: Be careful and type the e-mail address correctly. If you make a mistake, you will not receive a registration e-mail and be unable to complete the registration process.
uk: Будьте уважними і вводьте ел. адресу правильно. Якщо Ви помилитесь, то не отримаєте повідомлення з реєстраційною інформацією та не зможете завершити реєстрацію.

source: Binary file is not shown
uk: Бінарний файл

source: Birth Date
uk: Дата народження

source: COMMIT changes!
uk: ЗБЕРЕГТИ зміни!

source: Cancel
uk: Скасувати

source: Cannot allocate space to store run row %d
uk: Помилка виділення пам’яті для збереження рядка %d

source: Cannot calculate the file checksum
uk: Помилка підрахунку контрольної суми файла

source: Cannot guess the content type
uk: Неможливо визначити тип вмісту

source: Cannot participate
uk: Участь неможлива

source: Cannot read file!
uk: Помилка зчитування файла!

source: Cannot read message text!
uk: Помилка зчитування файла повідомлення!

source: Cannot read source text!
uk: Помилка зчитування файла повідомлення!

source: Cannot write run row %d
uk: Помилка запису рядка %d

source: Change
uk: Змінити

source: Change Language
uk: Змінити мову

source: Change Status
uk: Змінити статус

source: Change duration
uk: Змінити тривалість

source: Change flags
uk: Змінити атрибути

source: Change language
uk: Змінити мову

source: Change password
uk: Змінити пароль

source: Change status
uk: Змінити статус

source: Change tokens for displayed runs
uk: Змінити токени відображених посилок

source: Change!
uk: Змінити!

source: Changed by user
uk: Змінено користувачем

source: Changing flags of user %d in contest %d failed: %s
uk: Зміна атрибутів користувача %d в турнірі %d не вдалася: %s

source: Changing flags of user in contest failed
uk: Зміна атрибутів користувача в турнірі не вдалася

source: Changing status of user %d in contest %d failed: %s
uk: Зміна статусу користувача %d в турнірі %d не вдалася: %s

source: Changing status of user in contest failed
uk: Зміна статусу користувача в турнірі не вдалася

source: Charset
uk: Кодування

source: Check again
uk: Перевірити ще раз

source: Check contest settings
uk: Перевірити налаштування контесту

source: Check failed
uk: Помилка системи перевірки

source: Check failed runs
uk: Відправки з помилкою системи перевірки

source: Checker Token
uk: Токен програми перевірки

source: Checker output
uk: Виведення програми перевірки

source: Chief examiner
uk: Головний екзаменатор

source: Chief examiner must be assigned.
uk: Має бути призначено головного екзаменатора.

source: Choose an answer
uk: Варіанти відповіді

source: City
uk: Місто

source: City (En)
uk: Місто (Англ.)

source: Clar ID
uk: Номер повідомлення

source: Clar log update failed
uk: Не вдалося оновити журнал посилок

source: Clarification
uk: Повідомлення

source: Clarification requests are disabled
uk: Повідомлення відключено

source: Clars
uk: Повідомлення

source: Clars to all
uk: Повідомлення для усіх учасників

source: Clean up
uk: Очистити

source: Clean up and check settings
uk: Очистити та перевірити налаштування

source: Clean up and import settings
uk: Очистити та імпортувати налаштування

source: Clear
uk: Очистити

source: Clear BANNED
uk: Скинути атрибут BANNED

source: Clear DISQUALIFIED flag
uk: Скинути атрибут ДИСКВАЛІФІКАЦІЇ

source: Clear INCOMPLETE
uk: Скинути атрибут НЕПОВНОТИ

source: Clear INVISIBLE
uk: Скинути атрибут НЕВИДИМОСТІ

source: Clear LOCKED
uk: Скинути атрибут LOCKED

source: Clear contest passwords
uk: Скинути турнірні паролі

source: Clear contest passwords!
uk: Скинути турнірні паролі!

source: Clear displayed runs
uk: Очистити відображувані посилки

source: Clear displayed runs!
uk: Очистити відображувані посилки!

source: Clear disqualification
uk: Скинути дискваліфікацію

source: Clear finished flag
uk: Скинути атрибут перевіреності розв’язків

source: Clear runs
uk: Очистити посилки

source: Clear the BANNED flag for the selected users
uk: Скинути атрибут БЛОКУВАННЯ у відмічених користувачів

source: Clear the DISQUALIFIED flag for the selected users
uk: Скинути атрибут ДИСКВАЛІФІКАЦІЇ у відмічених користувачів

source: Clear the INCOMPLETE flag for the selected users
uk: Скинути атрибут НЕПОВНОТИ у відмічених користувачів

source: Clear the INVISIBLE flag for the selected users
uk: Скинути атрибут НЕВИДИМОСТІ у відмічених користувачів

source: Clear the LOCKED flag for the selected users
uk: Скинути ще один атрибут

source: Clear this entry
uk: Очистити цей запис

source: Clear variants
uk: Очистити варіанти

source: Client's requests are suspended. Please wait until the contest administrator resumes the contest
uk: Запити учасників тимчасово не обробляються. Будь ласка, зачекайте, доки турнір не буде продовжено

source: Close
uk: Закрити

source: Coach
uk: Тренер

source: Coaches
uk: Тренери

source: Coding style violation
uk: Порушення правил оформлення програм

source: Column name %s is already defined as column %d
uk: Стовпець %s уже визначено як стовпець із номером %d

source: Command-line parameters
uk: Параметри командного рядка

source: Comment
uk: Коментар

source: Comment for other judges (optional)
uk: Коментар для інших суддів (не обов’язково)

source: Common prefix to remove
uk: Спільний префікс імені для видалення

source: Compare
uk: Порівняти

source: Compare this run with run
uk: Порівняти цю посилку з посилкою

source: Compilation error
uk: Помилка компіляції

source: Compiled
uk: Скомпільовано

source: Compiler options
uk: Опції компіляторів

source: Compiler output
uk: Виведення компілятора

source: Compiler/style checker output
uk: Виведення компілятора та програми перевірки стилю

source: Compiling and running
uk: Компілюється й тестується

source: Compiling...
uk: Компілюється...

source: Compose a message to all participants
uk: Написати повідомлення всім учасникам

source: Configuration error
uk: Помилка конфігурації

source: Confirm Avatar
uk: Підтвердити аватар

source: Confirm action
uk: Підтвердити виконання

source: Confirm registration
uk: Підтвердити реєстрацію

source: Conflicting user_id (%d) and user_login (%s)
uk: Конфліктують user_id (%d) і user_login (%s)

source: Conflicting user_id and user_login
uk: Конфліктують user_id і user_login

source: Connection failed
uk: Підключення зірвалося

source: Content type
uk: Тип вмісту

source: Content type %s is disabled for problem %s in row %d
uk: Тип файла %s заборонено для задачі %s у рядку %d

source: Content type %s is not enabled for problem %s in row %d
uk: Тип файла %s не дозволено для задачі %s у рядку %d

source: Content type <tt>%s</tt> is disabled for this problem
uk: Тип файла <tt>%s</tt> заборонено для цієї задачі

source: Content type <tt>%s</tt> is not available for this problem
uk: Тип файла <tt>%s</tt> недоступний для цієї задачі

source: Content type is disabled for this problem
uk: Цей тип файла заборонено для цієї задачі

source: Content type is not available for this problem
uk: Цей тип файла недоступний для цієї задачі

source: Contest
uk: Турнір

source: Contest Flags
uk: Атрибути контесту

source: Contest ID
uk: ID контесту

source: Contest already finished
uk: Турнір уже завершено

source: Contest already started
uk: Турнір уже запущено

source: Contest configuration directory
uk: Каталог із конфігурацією контесту

source: Contest directory
uk: Каталог контесту

source: Contest is not available
uk: Контест недоступний

source: Contest is not finished
uk: Турнір ще не завершився

source: Contest is not started
uk: Турнір не почався

source: Contest is not stopped
uk: Контест не закінчився

source: Contest is ready for testing
uk: Контест готовий до тестування

source: Contest is unloaded
uk: Обслуговування турніру зупинено

source: Contest load time
uk: Час загрузки контесту

source: Contest management
uk: Управління контестом

source: Contest name
uk: Назва турніру

source: Contest password
uk: Турнірний пароль

source: Contest passwords
uk: Турнірні паролі

source: Contest passwords are disabled
uk: Турнірні паролі відключено

source: Contest priority
uk: Пріоритет турніру

source: Contest registrations
uk: Реєстрація на турніри

source: Contest selection
uk: Вибір турніру

source: Contest settings
uk: Налаштування турніру

source: Contest start date
uk: Час початку контесту

source: Contest start time
uk: Час початку турніру

source: Contest status
uk: Стан турніру

source: Contest time
uk: Тривалість турніру

source: Contest update time
uk: Час оновлення контесту

source: Contest: %d (%s)
uk: Турнір: %d (%s)

source: Contestant
uk: Основний учасник

source: Contestants
uk: Основні учасники

source: Continue
uk: Продовжити

source: Continue in this session
uk: Продовжити у данній сессії

source: Continue suspended editing
uk: Продовжити призупинене редагування

source: Coordinator
uk: Координатор

source: Copy
uk: Копіювати

source: Correct answer
uk: Правильна відповідь

source: Correct output
uk: Правильна відповідь

source: Country
uk: Країна

source: Country (En)
uk: Країна (Англ.)

source: Create
uk: Створити

source: Create account
uk: Створити обліковий запис

source: Create another account
uk: Створити ще один обліковий запис

source: Create contest!
uk: Створити контест!

source: Create user account
uk: Створити новий обліковий запис

source: Crop avatar
uk: Вирізати аватар

source: Current penalty
uk: Поточний штраф

source: Current standings
uk: Поточне положення

source: Cypher
uk: Шифр

source: Cypher is empty in row %d
uk: Шифр порожній у рядку %d

source: Cypher prefix
uk: Префікс шифру

source: DB time
uk: Відмітка часу BD
