Repository: arsijo/ejudge-translation
Catalog: ejudge.po
Languages: uk

source: Merging runs
uk: Злиття записів про посилки

source: Message
uk: Повідомлення

source: Message is empty
uk: Повідомлення порожнє

source: Message length is too big
uk: Текст повідомлення має надто велику довжину

source: Message length is too big (%zu)
uk: Текст повідомлення має надто велику довжину (%zu)

source: Messages
uk: Повідомлення

source: Middle name
uk: По батькові

source: Middle name (En)
uk: По батькові (Англ.)

source: Minimal random number
uk: Мінімальне випадкове число

source: Mkdir failed
uk: Mkdir не спрацював

source: Mkdir(%s) failed: %s
uk: Mkdir(%s) не спрацював: %s

source: Moderated registration
uk: Модерована реєстрація

source: More info
uk: Додаткова інформація

source: Move down
uk: Вниз

source: Move to advisors
uk: Зробити керівником

source: Move to coaches
uk: Зробити тренером

source: Move to contestants
uk: Зробити учасником

source: Move to reserves
uk: Зробити запасним

source: Move up
uk: Догори

source: Mult parameter
uk: Параметр mult

source: N/A
uk: Невід.

source: NO
uk: НІ

source: NOT REGISTERED
uk: НЕ ЗАРЕЄСТРОВАНО

source: Name
uk: Ім’я

source: Name is empty in row %d
uk: Ім’я порожнє в рядку %d

source: Neither user_id, login, name, nor cypher are specified
uk: Ні UId, ні Login, ні Name, ні Cypher не задані

source: Neither user_id, login, nor name are specified
uk: Ні UId, ні Login, ні Name не задані

source: New account <tt>%s</tt> is successfully created.
uk: Новий обліковий запис <tt>%s</tt> успішно створено.

source: New account is successfully created.
uk: Новий обліковий запис створено.

source: New duration is too small
uk: Нова тривалість турніру надто мала

source: New password
uk: Новий пароль

source: New password (1) is invalid
uk: Новий пароль (1) некоректний

source: New password (2) is invalid
uk: Новий пароль (2) некоректний

source: New password is generated.
uk: Новий пароль згенеровано.

source: New password is too long
uk: Новий пароль надто довгий

source: New passwords do not match
uk: Нові паролі не збігаються один з одним

source: New status: %s
uk: Новий статус: %s

source: New user account is created
uk: Новий обліковий запис створено

source: Next problem
uk: Наступна задача

source: No
uk: Ні

source: No advisors are allowed in this contest
uk: Категорія "керівники" не підтримується для цього турніру

source: No answer
uk: Нема відповіді

source: No answer is given
uk: Нема відповіді

source: No assignable runs.
uk: Немає відповідних посилок.

source: No assigned variant
uk: Немає призначеного варіанта

source: No coaches are allowed in this contest
uk: Категорія "тренери" не підтримується для цього турніру

source: No comments
uk: Без коментарів

source: No comments.
uk: Без коментарів.

source: No connection to the server
uk: Немає зв’язку з сервером

source: No contestants are allowed in this contest
uk: Категорія "учасники" не підтримується для цього турніру

source: No directory structure
uk: Немає структури

source: No email message at all will be sent to you.
uk: Вам НЕ буде надіслано жодних електронних повідомлень.

source: No entry for %d/%s
uk: Немає запису для %d/%s

source: No entry for %s/%s
uk: Немає запису для %s/%s

source: No guests are allowed in this contest
uk: Категорія "гості" не підтримується для цього турніру

source: No plugin is available for problem
uk: Для задачі відсутній модуль здачі розв’язків

source: No reserves are allowed in this contest
uk: Категорія "запасні" не підтримується для цього турніру

source: No runs to rejudge
uk: Немає посилок для повторної перевірки

source: No users registered for this contest
uk: На цей турнір ніхто не зареєструвався

source: No warnings
uk: Попереджень немає

source: No.
uk: Ні.

source: Not a virtual contest
uk: Не віртуальний турнір

source: Not all pre-required problems are solved
uk: Розв’язано не всі необхідні задачі

source: Not connected
uk: Немає зв’язку з сервером

source: Not set
uk: Не встановлено

source: Note, lines are numbered just for your convinience.
uk: Зверніть увагу, що рядки занумеровано для зручності перевірки.

source: Note, that if you do not do this in 24 hours from the moment of sending this letter, operation will be cancelled. If you don't want to regenerate the password, just ignore this message
uk: Якщо Ви не виконаєте цієї операції протягом 24 годин з моменту створення даного листа, повторну генерацію пароля буде скасовано. Якщо ж Ви не хочете перегенеровувати свій пароль, просто проігноруйте цей лист.

source: Note, that the exact reason is not reported due to security reasons.
uk: Зверніть увагу, що точна причина помилки не повідомляється з міркувань безпеки.

source: Notes
uk: Примітки

source: Nov
uk: Лис

source: Number
uk: Номер

source: Number of Clars
uk: Кількість питань

source: Number of Runs
uk: Кількість спроб

source: Number of printed pages
uk: Кількість надрукованих сторінок

source: Number of warnings
uk: Кількість попереджень

source: OVER
uk: ЗАВЕРШЕНО

source: OVER (frozen)
uk: ЗАВЕРШЕНО (заморожено)

source: Observer
uk: Спостерігач

source: Occupation
uk: Посада

source: Occupation (En)
uk: Посада (Англ.)

source: Oct
uk: Жов

source: Old password
uk: Старий пароль

source: Old password is invalid
uk: Старий пароль некоректний

source: Old password is too long
uk: Старий пароль занадто довгий

source: On-line users in this contest
uk: Користувачів у турнірі в цей момент

source: Online users
uk: Підключені користувачі

source: Open
uk: Відкрити

source: Open date
uk: Дата відкриття

source: Open for participation
uk: Відкритий для участі

source: Operation completed
uk: Операцію завершено

source: Operation completed with errors
uk: Операція завершилась із помилками

source: Operation errors
uk: Помилки під час виконання операції

source: Operation failed
uk: Операцію не виконано

source: Operation is not supported
uk: Операція не підтримується

source: Operation succeeded
uk: Операцію успішно виконано

source: Optional
uk: Необов’язковий

source: Originator IP
uk: IP-адреса відправника

source: Other
uk: Інше

source: Output
uk: Результат роботи

source: Output error
uk: Помилка виведення

source: Output file name
uk: Ім’я вихідного файла

source: Output format
uk: Формат результату

source: Output in
uk: Результат роботи у файлі

source: Packet is too big
uk: Пакет має надто великий розмір

source: Packet is too small
uk: Пакет має надто малий розмір

source: Packet name
uk: Ім’я пакета

source: Page
uk: Сторінка

source: Page generation time
uk: Час генерації сторінки

source: Pages printed
uk: Надруковано сторінок

source: Parameter is out of range
uk: Значення параметра не задовольняє діапазон допустимих значень

source: Parameter value
uk: Значення параметра

source: Partial solution
uk: Неповний розв’язок

source: Participant
uk: Учасник

source: Participants can view testing reports
uk: Учасники можуть бачити протоколи тестування

source: Participants can view their source code
uk: Учасники можуть переглядати вихідний код

source: Participants view judge score
uk: Учасники можуть бачити фінальні бали

source: Participants' requests are suspended
uk: Обробка запитів учасників призупинена

source: Participants' solutions are being accepted
uk: Розв’язки учасників приймаються на перевірку

source: Participants' solutions are being judged
uk: Розв’язки учасників перевіряються

source: Participants' solutions are judged
uk: Розв’язки учасників перевірено

source: Participate
uk: Узяти участь

source: Passed tests
uk: Пройдено тестів

source: Password
uk: Пароль

source: Password generation failed
uk: Згенерувати паролі не вдалося

source: Password generation failed: %s
uk: Згенерувати паролі не вдалося: %s

source: Password recovery completed [%s, %s]
uk: Відновлення пароля завершено [%s, %s]

source: Password recovery error
uk: Помилка відновлення пароля

source: Password recovery is not possible because of the following error.
uk: Відновлення паролю неможливе через наступну помилку.

source: Password recovery, stage 1 [%s, %s]
uk: Відновлення пароля, етап 1 [%s, %s]

source: Password regeneration requested
uk: Зроблено запит на повторну генерацію пароля

source: Password regeneration successful
uk: Повторну генерацію пароля завершено

source: Password update failed
uk: Змінити пароль не вдалося

source: Password update failed: %s
uk: Змінити пароль не вдалося: %s

source: Penalty
uk: Штраф

source: Pending XML import already exists
uk: Уже є задача імпорту XML на очікуванні

source: Pending check
uk: Очікує на перевірку

source: Pending review
uk: Очікує на підтвердження

source: Permission denied
uk: У доступі відмовлено

source: Permission denied. The possible reasons are as follows.
uk: У доступі відмовлено. Можливі причини цієї помилки перераховано нижче.

source: PhD student
uk: Аспірант

source: Phone
uk: Телефон

source: Place
uk: Місце

source: Planned start time
uk: Запланований час початку турніру

source: Please, enter your valid e-mail address and press the "Create account" button.
uk: Будь ласка, введіть Вашу актуальну ел. адресу та натисніть на кнопку "Створити обліковий запис".

source: Please, follow the following link.
uk: Будь ласка, перейдіть по наступному посиланню.

source: Presentation error
uk: Неправильний формат виведення

source: Press "Stop exam" button to finish the exam. Your answers will be checked shortly after that.
uk: Натисніть на кнопку "Завершити екзамен", щоб завершити екзамен. Після цього Ваші відповіді буде перевірено.

source: Previous problem
uk: Попередня задача

source: Previous submissions of this problem
uk: Попередні розв’язки цієї задачі

source: Print
uk: Роздрукувати

source: Print problem protocol
uk: Надрукувати протокол по задачі

source: Print requests are suspended
uk: Обробка запитів на друк призупинена

source: Print sources
uk: Роздрукувати вихідний текст

source: Print the exam full cyphered protocols
uk: Надрукувати повні зашифровані екзаменаційні протоколи

source: Print the exam full protocols
uk: Надрукувати повні екзаменаційні протоколи

source: Print the exam protocols
uk: Надрукувати екзаменаційні протоколи

source: Print the user examination protocols for the selected users
uk: Надрукувати екзаменаційні протоколи для відмічених учасників

source: Print the user full cyphered examination protocols for the selected users
uk: Надрукувати повні зашифровані екзаменаційні протоколи для відмічених учасників

source: Print the user full examination protocols for the selected users
uk: Надрукувати повні екзаменаційні протоколи для відмічених учасників

source: Print user examination protocol
uk: Надрукувати екзаменаційний протокол учасника

source: Print user full cyphered examination protocol
uk: Надрукувати повний зашифрований екзаменаційний протокол учасника

source: Print user full examination protocol
uk: Надрукувати повний екзаменаційний протокол учасника

source: Printing error
uk: Помилка друку

source: Printing is disabled
uk: Друк відключено

source: Printing problem protocol
uk: Друк протоколу по задачі

source: Printing quota (%d pages) is exceeded
uk: Перевищено квоту друку (%d сторінок)

source: Printing quota is exceeded
uk: Перевищено квоту друку

source: Printing user protocol
uk: Друк екзаменаційного протоколу учасника

source: Priority
uk: Пріоритет

source: Priority adjustment
uk: Корекція пріоритету

source: Priority value must be in range [-16, 15]. The less the priority value, the more the judging priority.
uk: Значення пріоритету повинно міститися в інтервалі [-16, 15]. Що менше значення пріоритету, то вищим є пріоритет.

source: Privileged users
uk: Привілейовані користувачі

source: Privileged users page
uk: Список привілейованих користувачів

source: Privileged?
uk: Привілейований?

source: Problem
uk: Задача

source: Problem column is undefined
uk: Стовпець Problem не визначено

source: Problem configuration error
uk: Помилка конфігурації задачі

source: Problem directory
uk: Каталог задачі

source: Problem filter expression
uk: Умова фільтрування задач

source: Problem is empty in row %d
uk: У рядку %d не визначено назву задачі

source: Problem priority
uk: Пріоритет задачі

source: Problem statements
uk: Умови задач

source: Problem status summary
uk: Підсумок по задачах

source: Problem summary
uk: Підсумок по задачах

source: Problems
uk: Задачі

source: Problems (serve.cfg)
uk: Задачі (serve.cfg)

source: Professor
uk: Викладач вишу

source: Prog. languages
uk: Мови програмування

source: Program output
uk: Виведення програми

source: Program output to stderr
uk: Виведення програми на stderr

source: Program stderr output
uk: Виведення програми на потік помилок

source: Programming language
uk: Мова програмування

source: Programming language statistics
uk: Статистика по мовам програмування

source: Programming languages
uk: Мови програмування

source: Protocol error
uk: Помилка протоколу

source: READ-ONLY
uk: ЛИШЕ ПЕРЕГЛЯД

source: REFRESH
uk: ОНОВИТИ

source: REFRESH PAGE MANUALLY!
uk: ОНОВЛЮЙТЕ СТОРІНКУ ВРУЧНУ!

source: REGISTERED
uk: ЗАРЕЄСТРОВАНО

source: REGISTERED (INVISIBLE)
uk: ЗАРЕЄСТРОВАНО (НЕВИДИМИЙ)

source: REGISTERED, BANNED
uk: ЗАРЕЄСТРОВАНО, ДИСКВАЛІФІКОВАНО

source: REGISTERED, LOCKED
uk: ЗАРЕЄСТРОВАНО, ЗАБЛОКОВАНО

source: REGISTERED, PENDING APPROVAL
uk: ЗАРЕЄСТРОВАНО, ОЧІКУЄ ПІДТВЕРДЖЕННЯ

source: REGISTRATION REJECTED
uk: РЕЄСТРАЦІЮ ВІДХИЛЕНО

source: RUNNING (frozen)
uk: ТУРНІР ТРИВАЄ (заморожено)

source: Random seed
uk: Насіння генератора ВЧ

source: Random variants
uk: Випадкові варіанти

source: Re: Your question
uk: Re: Ваше питання

source: Read error
uk: Помилка зчитування

source: Read the problem
uk: Читайте умову задачі

source: Read the problem.
uk: Читайте умову задачі.

source: Read-only?
uk: Лише зчитування?

source: Real time (sec)
uk: Астр. час (с)

source: Real time limit
uk: Обмеження на реальний час

source: Recover forgot password
uk: Відновити втрачений пароль

source: Recover password
uk: Відновити пароль

source: Refresh
uk: Оновити

source: Reg. read-only?
uk: Заборона модифікації рег. данних?

source: Regards, The ejudge contest administration system (www.ejudge.ru)
uk: З повагою Система ejudge (www.ejudge.ru)

source: Regenerate contest passwords!
uk: Заново згенерувати турнірні паролі!

source: Regenerate registration passwords!
uk: Заново згенерувати реєстраційні паролі!

source: Regenerate static content
uk: Перегенерувати статичне наповнення

source: Region
uk: Регіон

source: Register for another contest
uk: Зареєструватись на інший контест

source: Register for another contest and copy data
uk: Зареєструватись на інший контест та скопіювати данні

source: Registration
uk: Реєстрація

source: Registration deadline
uk: Термін реєстрації

source: Registration errors
uk: Помилки при реєстрації

source: Registration failed
uk: Реєстрація не вдалася

source: Registration failed: %s
uk: Реєстрація не вдалася: %s

source: Registration for contest failed
uk: Реєстрація на турнір завершилася з помилкою

source: Registration incomplete
uk: Реєстраційні дані неповні

source: Registration is incomplete
uk: Реєстраційні дані неповні

source: Registration mode
uk: Режим реєстрації

source: Registration password
uk: Реєстраційний пароль

source: Registration passwords
uk: Реєстраційні паролі

source: Registration rules
uk: Правила реєстрації

source: Registration time
uk: Час реєстрації на турнір

source: Regular users
uk: Звичайні користувачі

source: Rejected
uk: Відхилено

source: Rejected runs
uk: Відхилені відправки

source: Rejudge all
uk: Заново перевірити все

source: Rejudge all runs
uk: Заново перевірити всі

source: Rejudge all!!!
uk: Заново перевірити все!!!

source: Rejudge displayed runs
uk: Заново перевірити відображувані посилки

source: Rejudge displayed runs!
uk: Заново перевірити відображувані посилки!

source: Rejudge problem
uk: Заново перевірити задачу

source: Rejudge problem!
uk: Заново перевірити задачу!

source: Rejudge runs
uk: Заново перевірити

source: Reload
uk: Перезавантажити

source: Reload ALL Contest Pages
uk: Перезавантажити сторінки УСІХ контестів

source: Reload Contest Pages
uk: Перезавантажити сторінки контесту

source: Reload Statement
uk: Перезавантажити умови

source: Reload Statement In All Contests
uk: Перезавантажити умови на усіх контестах

source: Reload config files
uk: Перезавантажити конфігураційні файли

source: Reload config files for ALL contests
uk: Перезавантажити конфігураційні файли на усіх контестах

source: Remaining
uk: Залишається

source: Remaining attempts
uk: Відправки, що залишились

source: Remaining time
uk: Час, що залишився

source: Remember or write down the password!
uk: Запам’ятайте або запишіть пароль!

source: Removal of privileged user %d from contest %d failed
uk: Видалити привілейованого користувача %d з турніру %d не вдалося

source: Removal of privileged user from contest failed
uk: Видалити привілейованого користувача з турніру не вдалося

source: Removal of user %d from contest %d failed: %s
uk: Видалити користувача %d з турніру %d не вдалося: %s

source: Removal of user from contest failed
uk: Видалити користувача з турніру не вдалося

source: Remove
uk: Видалити

source: Remove ban
uk: Зняти блокування

source: Remove examiner
uk: Видалити екзаменатора

source: Remove from group
uk: Видалити з групи

source: Remove registrations
uk: Видалити реєстрації

source: Remove the CHIEF EXAMINER role from the selected users
uk: Заборонити роботу в ролі ГОЛОВНОГО ЕКЗАМЕНАТОРА відміченим користувачам

source: Remove the COORDINATOR role from the selected users
uk: Заборонити роботу в ролі КООРДИНАТОРА відміченим користувачам

source: Remove the EXAMINER role from the selected users
uk: Заборонити роботу в ролі ЕКЗАМЕНАТОРА відміченим користувачам

source: Remove the OBSERVER role from the selected users
uk: Заборонити роботу в ролі СПОСТЕРІГАЧА відміченим користувачам

source: Remove the selected users from the list
uk: Видалити відмічених користувачів

source: Remove the selected users from the list (ADMINISTRATORs cannot be removed)
uk: Видалити відмічених користувачів зі списку (АДМІНІСТРАТОРІВ не може бути видалено)

source: Reply to all
uk: Розіслати всім

source: Reply to sender
uk: Відповісти тільки відправнику

source: Report
uk: Протокол

source: Report file does not exist
uk: Запитаного файла не існує

source: Report for run
uk: Звіт щодо посилки

source: Report is not available
uk: Протокол не доступний

source: Report viewing is disabled
uk: Перегляд протоколів відключено

source: Reschedule
uk: Призначити час

source: Reserve
uk: Запасний учасник

source: Reserves
uk: Запасні учасники

source: Reset filter
uk: Скинути фільтр

source: Reset the contest
uk: Скинути турнір

source: Reset the contest!
uk: Скинути турнір!

source: Reset the contest!!!
uk: Скинути турнір!!!

source: Restart virtual contest
uk: Рестартувати віртуальний контест

source: Result
uk: Результат

source: Resume clients
uk: Дозволити роботу клієнтів

source: Resume printing
uk: Дозволити друк розв’язків

source: Resume testing
uk: Дозволити перевірку розв’язків

source: Return to the main page
uk: Повернутися до головної сторінки

source: Retype new password
uk: Пароль ще раз

source: Review comments
uk: Коментарі до програми

source: Review notes
uk: Нотатки для перевірки

source: Role
uk: Роль

source: Run
uk: Відправка

source: Run ID
uk: Номер розв’язку

source: Run comment
uk: Коментар до програми

source: Run comments
uk: Коментарі до програми

source: Run comments for previous runs
uk: Коментарі до попередніх програм

source: Run filter expression
uk: Умова фільтрування посилок

source: Run is read-only
uk: Цю посилку не може бути змінено

source: Run log update failed
uk: Оновити журнал посилок не вдалося

source: Run penalty
uk: Штраф за відправку

source: Run selection
uk: Вибір посилок

source: Run to compare to is not specified
uk: Посилку для порівняння не вказано

source: Run-time error
uk: Помилка виконання

source: Running...
uk: Виконується...

source: Runs accepted for testing
uk: Відправок, прийнятих до тестування

source: Runs being processed
uk: Посилки, що обробляються

source: Runs pending review
uk: Відправок очікує на підтвердження

source: Runs pending testing
uk: Відправок очікуючих тестування

source: Runs summoned for defence
uk: Викликаних на захист

source: Runs to change token info:
uk: Відправки для зміни інформації про токен:

source: STATUS UPDATE FAILED!
uk: ПОМИЛКА ОНОВЛЕННЯ СТАТУСУ!

source: Save
uk: Зберегти

source: Saved?
uk: Збережено?

source: Scheduled end time
uk: Запланований час завершення

source: School student
uk: Школяр

source: School teacher
uk: Шкільний учитель

source: Scientist
uk: Науковий співробітник

source: Score
uk: Бали

source: Score adjustment
uk: Корекція балів

source: Score bonus
uk: Бонусні бали

source: Score column is undefined
uk: Стовпець Score не визначено

source: Score gained
uk: Одержано балів

source: Score gained: %d (out of %d).
uk: Одержано балів: %d (із %d).

source: Score gained: %d (out of %d).<br/><br/></big>
uk: Одержано балів: %d (із %d).<br/><br/></big>

source: Score gained: %d (out of %d).<br><br></big>
uk: Одержано балів: %d (із %d).<br><br></big>

source: Score is empty in row %d
uk: Бали не задано в рядку %d

source: Score value `%s' is invalid in row %d
uk: Значення балів `%s' недопустиме в рядку %d

source: Security violation
uk: Порушення правил безпеки

source: Select another problem
uk: Вибрати іншу задачу

source: Select one of available contests
uk: Виберіть один з доступних турнірів

source: Select problem
uk: Вибрати задачу

source: Select variant
uk: Вибрати варіант

source: Send a message
uk: Надіслати повідомлення суддям

source: Send a message to judges
uk: Надіслати повідомлення суддям

source: Send an appeal
uk: Надіслати апеляцію

source: Send clarification
uk: Надіслати повідомлення

source: Send e-mail with password anyway
uk: Вислати повідомлення із паролем у будь-якому випадку

source: Send run comment
uk: Надіслати коментар до програми

source: Send run comment and OK run
uk: Надіслати коментар до програми й прийняти відправку

source: Send run comment and REJECT run
uk: Надіслати коментар до програми й відхилити відправку

source: Send run comment and SUMMON run
uk: Надіслати коментар до програми й помітити відправку SUMMONED

source: Send run comment and ignore run
uk: Надіслати коментар до програми та ігнорувати посилку

source: Send!
uk: Надіслати!

source: Sender
uk: Відправник

source: Sent submissions
uk: Надіслані розв’язки

source: Sep
uk: Вер

source: Serial No
uk: NN

source: Server error
uk: Помилка на сервері

source: Server is down
uk: Сервер не працює

source: Server start time
uk: Час запуску сервера

source: Server status
uk: Стан сервера

source: Server time
uk: Час на сервері

source: Service is not available
uk: Сервіс не доступний

source: Service is not available. Please, come later.
uk: Сервіс не доступний. Будь ласка, зайдіть пізніше.

source: Service not available
uk: Сервіс не доступний

source: Service that you requested is not available.
uk: Запитаний Вами сервіс не доступний.

source: Session update failed
uk: Змінити параметри сесії не вдалося

source: Session update failed: %s
uk: Змінити параметри сесії не вдалося: %s

source: Set
uk: Встановити

source: Set REJECTED run status
uk: Встановити статус Відхилено (REJECTED)

source: Set accepting mode
uk: Увімкнути режим прийому розв’язків

source: Set filter
uk: Встановити фільтр

source: Set finished flag
uk: Встановити атрибут закінченості перевірки

source: Set judging mode
uk: Увімкнути режим перевірки

source: Set permissions
uk: Встановити права

source: Set priorities
uk: Встановити пріоритети

source: Set status
uk: Встановити статус

source: Set the BANNED flag for the selected users
uk: Встановити атрибут ЗАБЛОКОВАНОСТІ для відмічених користувачів

source: Set the INCOMPLETE flag for the selected users
uk: Встановити атрибут НЕПОВНОТИ для відмічених користувачів
